graph main_graph (
  %observations[INT8, 1x17], exponents: [-7]
) initializers (
  %Tanh_lut_0[INT8, 256]
  %sac_diag_gaussian_actor.4.bias[INT32, 16]
  %/Constant_4_output_0[INT64, 1]
  %sac_diag_gaussian_actor.0.weight[INT8, 1x1x17x256]
  %sac_diag_gaussian_actor.0.bias[INT32, 256]
  %sac_diag_gaussian_actor.4.weight[INT8, 1x1x256x16]
  %sac_diag_gaussian_actor.2.bias[INT32, 256]
  %sac_diag_gaussian_actor.2.weight[INT8, 1x1x256x256]
  %/Constant_output_0[INT64, 1]
  %/Constant_3_output_0[INT64, 1]
  %PPQ_Variable_0[INT64, 1]
  %PPQ_Variable_1[INT64, 1]
) {
  %/sac_diag_gaussian_actor/sac_diag_gaussian_actor.1/Relu_output_0 = Gemm[activation = 'Relu', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%observations, %sac_diag_gaussian_actor.0.weight, %sac_diag_gaussian_actor.0.bias)
  %/sac_diag_gaussian_actor/sac_diag_gaussian_actor.3/Relu_output_0 = Gemm[activation = 'Relu', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%/sac_diag_gaussian_actor/sac_diag_gaussian_actor.1/Relu_output_0, %sac_diag_gaussian_actor.2.weight, %sac_diag_gaussian_actor.2.bias)
  %/sac_diag_gaussian_actor/sac_diag_gaussian_actor.4/Gemm_output_0 = Gemm[activation = 'Linear', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%/sac_diag_gaussian_actor/sac_diag_gaussian_actor.3/Relu_output_0, %sac_diag_gaussian_actor.4.weight, %sac_diag_gaussian_actor.4.bias)
  %/Gather_output_0 = Gather[axis = 0, quant_type = 'S8'](%/sac_diag_gaussian_actor/sac_diag_gaussian_actor.4/Gemm_output_0, %/Constant_output_0)
  %/Slice_output_0 = Slice[quant_type = 'S8'](%/Gather_output_0, %PPQ_Variable_0, %/Constant_3_output_0, %PPQ_Variable_1, %/Constant_4_output_0)
  %action = Tanh[lut = 'Tanh_lut_0', quant_type = 'S8'](%/Slice_output_0)
  return %action
}


initializers value:
%Tanh_lut_0, shape: [256], exponents: [-7], 
value: array([-128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -127, -127, -126, -125, -123,
       -120, -116, -109,  -97,  -81,  -59,  -31,    0,   31,   59,   81,
         97,  109,  116,  120,  123,  125,  126,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127], dtype=int8)
%sac_diag_gaussian_actor.4.bias, shape: [16], exponents: [-10], docString: b'layout ==> UNK', 
value: array([  24,  213, -322, -394,  -74, -232,  118,  -23, 5825, 6028, 5897,
       5319, 5263, 5908, 4924, 5815], dtype=int32)
%/Constant_4_output_0, shape: [1], exponents: [0], docString: b'layout ==> UNK', 
value: array([1, 0])
%sac_diag_gaussian_actor.0.weight, shape: [1, 1, 17, 256], exponents: [-4], docString: b'layout ==> N16HWC16', 
value: array([  -1,    0,   -8,   -1,    0,   -4,  -12,   -1,    6,    1,   -2,
          0,   -5,    2,   -1,   -3,   -9,    0,    3,   -1,   -1,    4,
          4,    1,    7,   -1,    1,   -1,    0,    0,    0,    1,   -5,
         -1,    4,    3,    1,   -1,    7,    0,   11,    0,    1,    1,
         12,    1,    1,   -4,   -3,   -1,    0,   -1,   -1,   -2,    2,
         -1,    9,   -1,    0,   -1,    1,   -3,    0,   -3,   -1,   -1,
        -11,  -79,    0,  -47,   -7,    1,    2,    0,    0,   12,  -16,
          3,    0,   -3,   -2,   -2,   -3,   -1,   -2,    2,   -1,    0,
         -1,   -3,   -1,    0,   -2,    2,   -1,    0,    3,    0,  -11,
        -10,    2,  -18,   28,    0,   -8,    0,    1,    0,    3,   -3,
          0,    1,   13,    0,   -7,   13,    0,   14,   28,   -2,  -11,
          2,   -2,    1,  -28,   14,   -1,    0,    0,   -1,  -10,    0,
          1,    2,    8,   -2,    2,    0,    0,   -1,   -9,   -9,   -1,
         -1,    3,    0,    1,   -4,   -1,    0,   -1,   -1,   -7,    0,
          0,    1,   -1,    0,    1,   -1,    0,    0,    2,   -5,    0,
          3,    2,   -2,    0,   -2,   -2,    0,   -1,   -4,    0,   -1,
         -2,    0,    3,    1,   -2,    0,   -4,    0,    6,   -1,    1,
          0,    2,    1,    0,   -1,   -1,    1,    0,   -1,    0,    0,
          2,   -1,    6,    0,   -1,   -2,   -2,   -2,   -1,    0,    4,
          0,   -6,    0,    0,   -4,    3,    0,    2,    0,   -1,   -3,
         -5,   -2,    1,   -1,    0,    0,   -4,    1,   -1,   -2,   -1,
          0,    4,   -1,    1,   -1,   -6,    1,   -1,    0,    3,    1,
         -2,    6,    1,    0,  -10,    0,   -4,    0,   -1,   -2,   -5,
          4,    0,    1,   -2,   -1,   -1,    1,   -1,    1,    4,    0,
         -6,    1,    1,   -1,   -3,   -2,   -2,    1,   -1,    0,   -3,
         -1,   -1,   -2,    1,   -4,   -1,    0,    0,    1,    2,   -4,
         -6,   -2,    0,   -4,   -3,    0,    6,   -2,   -2,    2,   -3,
         -2,   -2,    0,   -3,   -3,   -1,    1,    0,   -8,   -2,  -16,
         -4,    0,    0,    1,   -4,   -7,   -1,    1,   -1,    0,   -3,
         -8,   -1,   -3,   -3,   -5,    1,    0,   -1,    1,   -3,   -5,
          1,   -1,   -1,   -4,   -2,   -3,    0,   -5,    2,  -25,    9,
         -1,    0,   17,   14,    8,    0,   -1,   -3,   -7,    6,   -1,
          0,    2,    1,   -3,    5,    0,   -2,   -1,    0,    1,    0,
         -1,   -3,   -2,   -4,   -1,    1,   -8,   -1,   69,  -45,   -1,
          0,    1,   -9,    7,    2,    0,   15,  -18,  -27,    3,    0,
          7,   -4,   27,   23,    2,    2,    4,   -2,   -2,    1,    1,
          6,  -11,    7,    5,    0,    3,   -3,   -2,    5,    0,    0,
         -2,   -1,   -3,   -2,    1,   -2,   -4,   -3,   -4,    0,   -3,
         -4,    5,   -1,    1,    1,   -4,   -3,   -1,    0,    1,    2,
         -3,   -1,    1,    0,   -2,   -1,   -3,   -6,   -2,   -1,   -2,
          0,    0,    1,   -1,   -3,   -3,    0,   -1,   -1,   -2,   -2,
         -6,   -3,    0,    1,    2,   -1,    0,   -1,    1,   -4,   -1,
          2,    1,   -1,   -1,    3,    6,    7,    0,   -1,    0,    0,
          0,    0,    1,    0,    1,   -3,    0,    0,   -2,   -4,    4,
         -6,    0,    0,   -2,   -2,   -1,   -1,   -1,    3,   -4,   -2,
         -1,   -1,   -3,   -1,    0,    6,    0,   -1,   -3,   -1,   -2,
         -1,   -1,    1,    3,    1,    2,    0,    2,    2,   -1,    7,
          0,   -1,   -5,   -2,   -1,    0,   -1,   -4,    5,    1,   -1,
          0,    0,    2,   -1,   -3,    0,    0,   -1,    0,    0,    0,
          0,    1,    0,    0,    0,    4,   -6,    6,   -7,    1,    0,
          0,    1,    2,   -1,   -3,    1,   -1,   -7,    2,   -3,   -5,
          2,   -9,   -2,   -1,   -2,   -1,    2,   -1,   -1,   -8,    2,
          0,   -4,    3,    0,   -5,    3,    5,    4,   -1,   -3,    1,
         -1,    1,    0,    1,   -1,    1,   -2,   -1,    0,   -1,   -2,
         -3,   -2,    0,   -1,    2,    0,   -2,   -2,    0,    0,   -1,
         -1,    0,    0,    9,   -1,    5,    1,    0,   -1,    1,    0,
          0,   -8,  -11,   11,    1,  -16,  -14,  -21,   -1,    0,   -4,
         -1,   -1,    0,   -1,    1,   -4,   -1,    5,   -1,   -1,   -3,
          1,    1,   -3,  -23,   -5,   14,   -1,   -1,    1,    1,   -5,
        -35,   -7,   -3,   -1,   14,   -3,  -11,    5,  -11,   28,  -28,
         -1,    0,    4,    1,   -1,  -28,   20,    1,    1,   43,   -2,
        -13,    1,  -11,  -16,   -5,   -1,   -2,   -2,    0,   -2,   -5,
          6,    0,    0,    9,    2,   -1,   -1,    3,    7,    2,   -1,
          0,    0,    0,   -1,   -2,    1,    0,   -2,    2,   -1,   -1,
          1,    3,    2,   -1,   -1,   -1,   -2,   -2,   -1,    0,    0,
          1,    0,   -4,   -3,   -2,   -1,    2,    6,   -4,   -1,    0,
         -2,   -1,    4,    2,   -4,   -1,   -1,    4,   -4,    0,   -5,
         -5,   -6,    2,    0,    1,    0,   -2,    0,   -4,   -4,    0,
          0,   -1,   -2,    3,    3,   -5,   -3,   -3,    0,   -1,    1,
         -2,    0,   -4,    6,   -1,    1,    7,   -3,    1,   -4,    0,
          1,    0,    1,   -1,    0,    0,   -3,   -1,   -3,   -2,    0,
          1,   -2,    5,    1,    0,   10,   -3,   -1,   -1,   -1,    1,
          1,    2,   -2,   -4,   -1,    2,    0,   -2,   -4,   -3,   -1,
          0,   -1,   -2,    0,   -1,   -2,   -3,    2,   -2,    0,   -3,
         -1,    0,    1,   -4,    1,   -3,  -16,   -5,    0,    2,    1,
          0,    1,   -4,   -3,   -2,   -3,   -4,   -2,   -2,    0,   -2,
         -4,   -3,   -2,   -3,    2,   -1,    0,   -8,   -1,   -1,    1,
          1,   -1,   -1,    1,    0,    7,    0,    0,   -2,    1,   -1,
         -1,    6,    0,    4,   -1,   -4,   -2,   -2,    1,   -3,    2,
         -2,   -1,    1,    0,    0,   -1,   -1,   -1,    2,    0,   -2,
         -1,   21,  -43,   12,   -3,    6,   -1,   30,    1,    1,    1,
         -3,   -6,   11,   -3,   -4,    0,   -3,   -2,   -1,   -3,    0,
         -1,   -3,   -1,    0,    0,    1,    2,   -1,    1,   -1,    0,
         -9,   11,   -2,  -20,   -4,   -1,  -21,    0,   -1,    0,  -29,
          0,    2,    1,    5,    1,   -5,    5,   10,  -33,  -13,   -2,
         17,    1,    0,    2,   38,    0,    4,    0,   -8,   -2,   -2,
          2,   -5,   10,   -5,   -1,    0,    0,    0,    1,    2,   -2,
          0,   -1,   -2,   -1,   -3,   -1,    0,    3,   -1,    0,    2,
         -2,    0,    0,   -2,    2,    2,    0,   -1,    0,   -3,   -2,
         -2,    7,    3,   -1,    7,   -1,   -1,   -2,   -4,   -1,    0,
         -1,   -1,   -1,    1,    1,    1,   -7,   -1,    0,    0,   -1,
         -1,    1,    2,   -1,   -2,   -1,    2,   -1,   -2,    4,    0,
          0,   -1,    0,    0,    0,   -1,   -1,    1,    0,   -2,   -2,
          0,    1,   -3,    1,   -1,    1,   -3,    0,   -1,    0,    0,
          0,   11,   -2,   -2,    1,   -1,   -1,   -3,    4,   -1,    3,
         -1,    0,   -3,    0,   -2,    1,    5,   -1,   -2,    0,    0,
          0,   -2,   -1,    0,  -10,   -3,   -2,    2,    0,   -1,    0,
         -2,   -3,   -2,   -1,    1,    0,    0,   -4,   -1,    1,   -2,
          1,   -1,   -1,    0,   -1,   -4,    0,   -2,    0,   -1,   -1,
         -1,    2,   -3,    0,   -7,   -2,    5,    0,   -5,    1,   -3,
         -3,   -1,    8,   -2,    0,   -2,   -7,   -1,    1,   -2,    3,
          2,   -2,    1,   -2,    6,   -2,   -1,    6,    0,    1,   -1,
         -3,   -5,   -2,   -2,    1,    3,   -3,    2,    1,    0,   -2,
          1,    9,   -1,   -1,   -1,    0,   -2,    0,   -5,    0,   -1,
          0,   -1,   -1,   -1,   -1,    1,    8,    0,    1,   48,    1,
          5,    1,   12,    6,  -37,   17,    1,   -1,    1,   -3,   28,
          1,   -1,   -1,   -3,   -3,    1,   -2,    1,   -2,   -1,   -3,
         -1,   -1,   -2,   -1,    2,    7,    2,    0,    1,    7,   -8,
          0,    0,   -4,   15,    4,   18,   -1,    1,   -2,   12,  -36,
         -2,    0,   24,   20,   -8,   -1,   25,   -6,  -16,    0,   22,
         -1,    7,   -3,   -5,   20,    1,    0,    1,    4,   -2,   -1,
         -9,   -2,   -9,   -1,   -5,    0,   -3,    2,   -3,    2,    0,
         -1,    0,    1,   -1,    0,    1,    3,    3,   -2,   -6,   -1,
          0,   -1,    0,   -4,    1,    0,   -4,   -1,   -1,    1,   -4,
          2,   -2,    1,    0,    0,   -2,    0,   -1,    2,   -2,    0,
         -3,   -2,    1,   -2,    2,   -1,   -4,   -1,   13,   -1,    2,
         -1,    4,    5,   -2,   -1,   -2,    2,    4,    0,   -4,   -3,
         -1,   -2,    3,    1,   -1,    0,    2,   -7,   -1,    0,   -2,
          2,   -5,   -1,   -1,   -3,   -2,    0,    5,   -1,    2,   -1,
          0,    2,   -1,    0,   -4,   -3,   -1,    0,    0,    1,   -3,
         -1,   -5,    0,    1,    0,    0,  -10,   -2,    0,    4,   -1,
         -2,    0,    0,   -6,    1,   -5,   -4,   -1,   -4,   -2,    2,
          2,    1,    1,   -3,   -3,    0,   -1,   -2,   -1,    1,   -1,
          2,    0,   -1,    1,    0,   -3,    0,    0,  -10,    0,   -2,
         -2,   -1,   -3,   -2,   -2,   -2,   -8,   -8,   -3,    0,    0,
         -3,    0,    5,    0,    6,   -2,   -1,   -2,    0,   -1,    0,
         -1,   -3,   -2,    0,    1,    2,   -1,    3,   -1,   -2,   -3,
         -1,    1,    1,    1,    0,    1,    0,   -3,    0,    1,    0,
         -2,   -1,   -1,    1,   -2,   -1,   -3,    0,   -3,   -1,   -4,
          1,   -3,    0,    0,    0,   74,  -10,    1,   -5,   12,    1,
         18,    0,    5,    1,    3,   13,    1,    0,   -2,  -45,   -1,
         -1,    0,    1,   -1,    0,   -2,    1,   -1,   -1,   -3,    0,
         -2,   -1,    1,    1,    0,    4,    2,  -31,    2,    0,    2,
         -1,   10,    1,   -7,  -53,   11,    1,    0,    1,    0,   48,
         -2,   56,    0,   -1,   -3,    1,   10,    1,   32,  -21,    6,
         -1,    0,   -5,   -1,   -5,   -1,    0,    0,    0,   -1,    0,
         -3,   -1,   -7,   11,   -2,   -2,    0,    0,   -1,    5,    1,
          2,   -1,   -2,   -3,    0,    2,    1,    0,   -4,    2,    0,
         -2,    1,    2,   -3,   -1,    3,   -2,   -2,   -2,   -1,   -2,
         -1,   -3,    5,    0,   -1,   -2,    5,    0,    3,   -1,    1,
          1,   -1,    0,   -1,    0,    0,    5,   -2,   -3,    0,    0,
          2,    3,   -4,    0,   -6,   -1,    0,   -2,    0,    3,   -2,
         -5,   -2,    0,    0,    2,    3,   -1,    5,    0,    1,    0,
          0,   -1,   -1,    1,   -1,    2,   -4,    2,    0,   -1,    3,
          3,   10,   -1,    1,   -2,   -3,   -2,   -2,    0,   -1,    0,
          2,    0,    0,    1,    0,    0,    1,    0,   -2,    1,   -1,
         -1,    1,    0,    1,    0,   -3,   -2,   -1,   -1,   -2,    0,
         -9,    0,   -4,   -1,   -1,    0,   -1,    0,    1,   -4,    4,
          1,    1,    0,    3,   -2,   -2,    5,   10,   -5,    0,    1,
          1,    5,   -5,   -4,   -2,    4,    4,    0,   -1,   -1,    2,
         -7,    7,   -2,   -1,   -1,    0,   -3,    0,   -4,   -4,   -1,
         -4,    0,   -3,    0,    0,   -4,    4,   -6,    1,    7,    0,
          2,    0,    8,   -4,    8,    0,   -1,   -5,    0,   -1,   -1,
          4,   -1,   -1,    0,    0,    2,   -1,    1,   -2,    2,    1,
          0,   -1,    1,    1,    0,   -5,   13,    0,    6,   -2,   64,
        -23,  -38,   -3,   30,    4,    1,   10,   -1,    1,   -2,   -2,
          1,   -1,   -1,    1,    1,   -3,    1,    2,    2,    0,   -1,
          0,    8,    1,   58,   62,  -21,   -1,  -10,    0,  -10,   12,
        -23,  -11,  -21,   -6,    2,   -2,   -5,    1,   20,  -33,   22,
          4,   14,   -1,   19,  -13,  -50,   20,   -7,    4,    0,    2,
          1,    0,    5,   -5,    5,    0,    1,    0,   -2,    1,   -3,
          0,   -1,   -4,   -1,   -2,   -1,   -2,   -2,    4,   -2,    0,
          4,   -2,   -3,    2,   -1,    6,    2,    0,   -1,   -1,    0,
          0,   -4,   -5,   -3,    0,   -2,    0,   -5,    4,    1,    0,
         -4,   -3,    0,    0,   -3,    0,    4,   -7,   -1,    0,    0,
          0,   -2,    0,   -8,   -4,   -3,   -1,    0,   -2,    1,    0,
          8,    8,   -4,    1,   -3,   -1,   -6,    2,   -2,    3,    2,
         -1,   -2,    0,    1,    0,    7,    0,    0,   -1,    1,    0,
         -7,    0,   -3,   -6,   -1,    1,    0,    0,    0,   -1,   -6,
         -4,    2,    0,   -3,   -1,   -1,   -2,    0,    1,    3,   -2,
          2,    0,   -5,   -1,   -3,   -2,   -1,   -1,    3,    0,   -1,
          4,   -1,    6,    2,    1,    0,    0,    1,    0,   -2,    4,
         -2,    1,   -1,   -2,   -5,    1,    4,    1,   -7,    0,   -1,
         -1,   -2,   10,    1,   -2,    0,   -2,   -2,  -13,   -2,    0,
          0,    3,   -1,    0,    0,   -1,   -1,    1,   -6,   -2,    0,
         -2,    0,    3,   -1,    4,    0,    0,   -1,    0,    0,    0,
         -1,   -9,   -6,   13,   -1,    1,    0,   -1,    0,   -4,   -1,
          4,    0,   -2,    1,   -1,    1,    3,   -2,    0,    2,    0,
          0,    1,   -1,   -1,   -1,    1,   -1,    1,    1,   -1,    0,
          3,   -7,  -45,    1,    9,    0,  -21,   -9,   -4,    1,  -84,
          0,    0,   -1,   -1,   -2,    0,   -1,    3,   -1,   -1,    0,
         -1,    0,    1,   -2,    2,    0,   -1,    0,    1,    1,   22,
         -3,   13,    1,    2,   -1,  -16,    8,    8,    1,    8,    3,
          0,   -1,    1,    0,  -48,   -4,  -47,    1,    3,   -2,    7,
         -3,   -6,    0,    0,   -1,    0,    1,    0,   -1,    7,    1,
          0,    0,   -3,    0,    0,   -2,   -1,    0,   -2,    1,   -1,
          1,   -1,    0,   -5,   -3,    1,   -1,    1,    0,   -1,   -1,
         -5,    1,    1,    0,    0,   -1,    0,    0,    4,   -2,    4,
         -1,   -1,    0,    0,   -2,   -3,    0,   -5,    0,   -1,    0,
          0,   -1,   -6,    0,   -5,   -1,    0,   -1,   -1,    1,    0,
          1,    0,    0,    0,    0,   -1,    0,    4,   -1,   -5,    0,
         -2,    0,   -2,    0,    1,   -1,   -1,   -2,   -1,    0,    1,
          1,    2,    3,    0,   -2,   -2,    0,   -6,    0,   -3,   -1,
          0,   -1,   -1,    0,    0,   -1,    3,   -3,    1,    1,   -2,
          0,    1,   -1,    1,    1,   -4,    0,   -1,   -1,   -1,   -1,
         -2,    2,  -11,   -1,   -1,    0,    3,   -1,    1,   -1,    1,
          0,    1,   -1,   -1,    0,    0,    0,    0,   -1,   -1,   -1,
          0,    0,    1,   -1,   -1,    0,   -1,   -1,   -1,    0,    0,
          2,   -1,    0,   -1,    3,    5,   -4,   -1,   -1,   13,   -2,
          1,    1,    0,   -1,    0,   -1,    5,    1,   -5,   -6,    4,
         -2,   -1,    0,   -1,    0,    1,   -3,   -1,   -1,   -1,   -1,
         -9,    0,   -4,  -10,    1,   -1,    1,    3,    4,    0,   -3,
          2,   -2,    1,    0,   -2,    3,    0,    1,   -6,    2,   -3,
          0,   -1,    1,   -2,   -2,    1,    0,   -1,    1,   -5,    4,
          1,   -1,  -13,   26,    6,    9,    9,   -9,    0,   20,    6,
          0,   -1,    1,    4,    7,    0,    3,   -3,    0,   -1,   -1,
          1,   -2,    1,    2,   -2,    1,    1,   -1,  -62,   10,    0,
        -54,   41,   17,   -3,    2,    4,   49,   -1,   -8,    1,    1,
          1,    0,  -29,    3,   -1,  -36,  -16,    4,    2,    3,   -1,
         -3,   -1,   18,    1,   -1,   -1,   -3,   -5,   15,    0,    5,
         -3,   -1,   -1,    0,   -2,   -4,    0,   -2,   -3,   -1,    0,
         -1,   -2,   -3,   -1,  -14,   -1,   -2,    1,    0,   -1,   -3,
         -1,    3,    0,   -1,   -1,   -2,    7,   -3,   -1,   -1,   -1,
          0,   -1,    0,   -3,   -7,    0,    0,    1,   -1,    0,    2,
          2,   -4,    1,    6,   -8,   -1,   -3,   -1,    0,    7,    0,
          2,    0,    1,   -2,   -1,   -6,    2,    0,    2,   -1,    1,
          0,    2,   -2,   -1,    0,   -1,   -4,   -1,    0,   -1,   -9,
         -3,    0,   -1,    3,    0,    2,   -4,   -2,    4,    1,   -1,
         -1,    0,    1,    0,    5,   -6,   -2,    8,    0,   -4,    2,
          0,    0,   -6,   -1,   -1,   -2,   -1,    0,    0,    6,   -1,
         -1,   -4,   -5,   -5,   -2,   -1,   -2,    6,    1,   -1,    2,
          0,    0,   -1,   -1,    6,    0,    2,    0,   -1,   -1,   -1,
          0,    0,   -1,    2,   -1,    1,    1,   -3,   -1,    0,   -9,
         -1,   -1,    0,    0,   -1,    1,   -4,    2,   -1,   -2,   -1,
          0,   -1,   -2,    0,   17,  -11,   -2,   -1,    0,   -2,    0,
         -3,   -7,   -2,   -7,   -1,  -12,    0,    2,    0,   -3,    1,
          6,    1,    0,    1,   -1,   -1,    4,    1,    5,    1,    0,
          1,   -1,    0,    3,   -3,   -1,    1,    1,   -1,   -1,   -1,
         -3,    0,   -2,   -2,   -8,    5,   -5,    0,    2,    6,   12,
         -1,    0,   11,   -9,   -7,   12,   -1,  -16,    3,   -1,   -1,
          1,   -1,   -1,    0,   -4,    0,    0,    0,    1,    1,    3,
          0,   -1,    1,   41,   -1,   -1,   -1,   -8,    5,   -3,    0,
          2,    1,    7,   -2,   42,   -1,  -27,    3,  -47,    0,    4,
          0,    3,    1,  -26,   -1,   -2,    2,   -6,    3,   12,    0,
         -1,    3,    8,   -1,    0,    0,   -6,   -2,   -7,   -1,    1,
          0,   -1,   -2,   -8,    1,   -2,    0,   -6,    1,    2,   -1,
          1,    1,   -5,   -2,    0,   -1,   -3,    1,    5,   -1,   -1,
          0,    3,    0,    1,    0,    2,   -1,   -1,    0,   -1,   -1,
         -1,   -2,   -1,    0,    3,   -1,   -6,    0,   -1,   -1,    4,
          2,    2,   -1,   -1,    0,    0,   -1,   -4,    0,    6,    0,
          2,   -2,   -1,    1,   -1,    2,    2,   -1,    0,    1,   -1,
          0,    3,   -1,    0,    0,    9,    0,   -1,   -1,   -7,    3,
         -6,    0,   -2,   -2,    0,   -1,    3,   -1,    0,   -1,    2,
         -2,   -2,    0,   -5,   -3,   -1,   -1,   -1,   -2,   -1,   -2,
         -1,   -1,   -2,    0,   -9,   -5,   -1,    0,   -3,    2,   -4,
         -1,    0,   -2,    1,    1,   -1,    1,   -3,   -1,    6,    2,
         -2,    1,    4,   -2,    1,    1,   -1,   -1,   -3,    0,    1,
          0,    1,    1,   -1,   -2,    4,   -1,    2,   -5,   -4,   -2,
         -2,   -1,    2,   -3,    0,    0,    0,   -2,   -2,    1,   -2,
          1,   -1,    1,   -1,    3,   -2,   -1,    0,    0,   -1,   -1,
          2,   -2,   -2,    1,   -7,    0,    4,    1,   -1,    2,    0,
          1,    0,    3,    1,    0,   -1,    1,   -1,   -2,    0,   -1,
          0,   -2,   -1,    1,    1,    1,   -2,    0,    1,    1,   -3,
         -1,  -21,   17,   10,    0,  -39,  -15,   -1,    9,    8,    1,
          1,    1,    2,    1,  -59,   18,   -2,   -5,   -2,   -1,    0,
          0,    4,   -2,    0,    0,    0,   -2,   -1,    0,   -3,   -1,
         -1,    0,   -4,    0,    0,    2,  -11,    8,   -2,   -1,    5,
          0,   -1,   -1,   24,   10,    8,   -4,    1,    1,  -13,    6,
          8,   -1,    3,    1,   -4,   -5,   -3,   -1,   -4,   -1,    2,
         -4,    4,    0,   -2,   -2,   -4,   -3,   -2,   -2,   -3,   -1,
         -1,    1,   -4,    0,   -2,   -3,   -5,    1,    1,    3,    1,
          0,    2,   -1,    1,    0,    0,    0,   -2,   -2,    0,    0,
         -3,   -2,    3,   -2,   -3,   -3,   -2,   -1,    1,   -1,   -1,
         -1,   -3,   -2,   -3,    2,   -1,    0,    2,   -1,   -2,    4,
         -1,   -1,    0,    0,   -1,   -1,   -5,    0,   -2,   -2,   -1,
         -1,    1,   -1,   -1,   -3,    0,    0,   -2,    0,    0,    0,
         -1,   -2,   -2,   -2,    2,    0,    1,   -3,   -2,    0,   -2,
          0,    0,    1,    0,    0,   -2,    0,   -2,   -2,   -3,   -1,
          0,    0,    3,   -2,   -1,    0,    0,    2,   -2,   -1,   -5,
         -1,   -1,   -2,    2,    0,    1,   -5,    2,   -2,   -2,   -2,
          0,   -3,    0,   -3,   -8,   -1,    0,   -1,   -1,    0,    2,
         -1,   -4,   -3,   -1,   -2,   -1,   -1,   -1,    0,   -5,   -2,
          0,   -4,   -3,  -10,   -4,    0,    2,    0,   -2,   -3,    0,
          2,    8,    3,    3,    4,   -1,    1,    5,    3,    0,   -1,
         -7,    1,    0,  -10,   -4,   -4,   -4,    5,    2,    8,   -1,
          2,    2,    3,   -7,    1,   -4,   -1,  -10,   -2,   -2,   -9,
         -9,    2,   -4,   -6,   -2,   -1,    1,   -2,   -6,   -1,   -1,
         -1,   -2,   -5,   -3,    2,    1,    4,   -1,    0,    2,    2,
         -3,   -3,  -12,    1,   -3,   -2,   -4,   -4,   -2,   -5,  -16,
         -2,   29,  -14,    1,   -1,   -1,   -2,   -2,   -1,   -1,    0,
          0,   -3,   -2,    0,   -3,   -1,   -2,    3,   -1,    0,  -13,
          3,   -1,   -1,    9,   -1,   -3,   47,    5,   -1,   28,    2,
          2,   63,   -4,    4,    3,  -12,  -26,   -1,   -2,    0,  -15,
          0,    2,   -5,   -4,    7,   15,   22,   -5,   -9,   -1,   -7,
         -5,   -1,    0,    0,    5,  -10,    1,    6,   -1,    1,   -4,
         -6,    0,    2,    1,    3,   -2,    0,   -2,    0,   -7,    8,
          2,   -8,    0,   -4,    7,    2,    2,   -1,    0,   -1,    4,
          0,   -3,   -1,   -4,   -3,   -1,   -1,    1,   -2,    2,   -5,
         -2,    1,    1,    1,    2,    0,   -3,    0,   -4,   -7,   -3,
         -6,   -4,   -3,   -4,   -1,    0,   -1,    0,    1,    3,   -2,
          0,    1,    0,    6,   -1,   -1,    2,   -2,   -2,    8,   -2,
         -1,   -6,   -6,    1,   -1,    2,    0,   -1,    2,    2,    0,
          1,   -5,    2,    1,    0,    1,    0,    0,    0,    0,   -2,
         -2,    2,    1,    1,    1,    3,   -2,    3,   -2,    0,   -2,
         -5,   -1,    1,    0,    1,    0,    1,    6,   -2,    2,    2,
          0,    2,    0,   -1,   -1,    0,   -1,    2,    1,    2,    1,
          3,    1,    0,    2,    2,   -2,    5,    2,   -3,   -5,    7,
         -5,    2,    0,    3,   -1,    6,   -1,    0,   -1,   -2,    0,
          1,   -2,   -2,   -2,  -13,    7,    0,   -3,   -3,    0,   -1,
          0,    0,   -1,    5,    0,   -1,   -3,   -4,    3,    6,   -1,
          2,    0,   -3,    0,   -1,    0,    0,   -1,  -10,   -1,   -1,
         -2,   -3,    0,   -3,   -4,   -1,    0,    3,    0,    5,    1,
          0,   -2,    1,   -1,    0,   -1,   13,   13,  -46,  -24,   -1,
          1,    2,   -1,  -12,    2,    0,    1,  -24,   -1,    9,   -6,
          0,    0,    3,    1,   -1,    1,   -9,   -2,   -1,    0,   -1,
          0,    2,   -2,    0,   -2,    3,   -9,   14,  -17,   -1,    4,
        -23,    0,  -15,   -2,    0,   -1,  -58,    0,    0,   -5,   -1,
         -6,   10,   80,    0,    1,   28,    0,  -34,   -1,    0,    4,
        -16,    1,    1,   11,   -1,    0,  -12,    0,    1,   -4,    8,
          0,    6,    0,   -1,   -1,    6,   -1,    2,    5,    1,    0,
         -2,    5,    0,    0,   -8,    0,   -6,   -1,   -1,   -2,   -5,
          0,   -3,    0,    0,   -1,   -3,   -9,    0,   -2,   -3,   -1,
         -1,   -1,   -1,    1,    6,    0,    0,   -1,   -2,    0,    7,
          2,    0,    1,    4,    0,   -5,    0,    0,   -1,   -3,   -1,
         -2,   -5,   -1,   -2,    1,   10,   -1,   -1,    1,    1,    3,
         -2,    0,   -1,   -1,    0,   -1,   -1,   -3,   -2,    2,  -10,
          0,    0,    7,   -1,   -7,   -2,    0,    1,   -6,    1,   -1,
         -1,   -3,   -1,   -5,    1,   -1,    0,   -1,    0,    2,    1,
          1,    0,    4,    0,    0,    1,   -1,   -3,    2,   12,   -1,
          0,    9,    1,    3,    1,    1,    0,   -1,    2,   -2,   -1,
          0,   -2,    1,   -5,   -1,    1,   -4,   -1,    5,    0,    0,
          1,    2,   -1,   -1,    1,    0,    0,    0,   -1,    1,    1,
          8,    6,    1,    0,   -1,   -4,    2,   -2,   -1,    3,   -2,
         -1,    1,    0,   -2,   -1,    5,   -3,    0,    0,    0,   -2,
          0,    1,   -1,   -6,    0,    1,    1,    1,   -1,    2,    3,
         -6,   -2,   -1,    0,  -10,    0,   -1,   -1,   -3,   -1,   -1,
         -2,   -1,   -1,   -1,    4,   -1,    1,    0,    0,   -8,    1,
          1,    0,   -5,  -22,    1,    9,   -2,  -73,  -82,  -18,   -4,
          0,   -2,    2,    0,    1,    0,    0,   -8,    1,    0,   -4,
          0,    1,   -1,    3,    1,    1,    0,    0,    0,   -2,    0,
         -1,   -1,  -90,    1,    0,    2,   -8,  -12,   -1,   27,    0,
          0,    2,  -31,    0,    0,   -1,   -1,   15,    0,    2,   -1,
          7,   15,  -31,  -15,    0,    1,   -1,   10,    2,    1,    0,
         -1,    4,   -2,   -5,   -3,    1,    1,    6,    3,    0,   -2,
         -3,   -8,    1,    1,    0,   -6,   -4,    0,    0,    0,   -1,
         -1,   -4,    2,    0,   -1,    0,   -3,    0,    0,    0,   -1,
          1,    1,   -1,   -1,    1,   -1,    4,    1,   -1,    0,    0,
          1,   -1,   -1,    0,    0,   -1,    0,    1,   -1,    1,    0,
          2,   -4,    1,   -1,    0,    5,   -2,   -1,    1,    1,   -8,
          1,    1,   -1,   -3,   -2,   -1,    5,    0,    0,    1,   -1,
          0,    1,   -1,    0,   -7,   -1,   -3,   -1,    1,   -4,    0,
          5,    1,    0,   -2,   -6,   -2,   -1,    0,    0,    2,   -2,
          2,   -1,   -3,   -1,   -1,    6,   -1,   -1,    0,    1,    0,
          2,    0,    0,    9,   -1,    1,    2,   -2,    0,   -4,   -4,
         -3,   -1,    1,    8,   -2,   -3,    1,    0,    1,   -1,   -3,
          1,   -4,   -3,    0,   -5,   -1,    2,    0,    4,    0,   -2,
         -1,   -3,    0,    0,   -1,   12,   -6,   -1,   -6,   -1,   -1,
         -1,  -11,    1,   -2,   -1,    1,    6,   -2,   -4,   -1,   -8,
          2,   -1,   -4,    1,   -7,    0,  -12,    1,    5,   -4,    0,
          9,   -2,   -9,   -1,    4,    2,    0,   -3,    0,    5,   -4,
          1,    1,   11,    0,   -1,   -9,    0,   -3,    2,    3,    0,
         -2,   -5,    0,    0,   -3,   -4,    0,    0,   -1,   -2,    1,
         -1,   -3,   -1,   -3,    7,   29,   11,    1,   -6,    4,    5,
         -1,    4,    2,    0,   -2,    0,    1,    0,   -4,    4,   -1,
          1,    0,   -1,    0,   -1,   -1,    0,   -3,   -1,   -1,   -2,
         -6,    0,  -19, -100,   -9,  -31,    1,   15,    6,  -12,   -1,
         20,    4,   -1,   39,    1,   -8,    0,   -8,   31,    0,  -11,
          0,   10,  -11,  -55,    0,  -37,    8,   -2,   17,    1,    2,
          0,    3,   -1,   -1,   -2,   -3,    1,   -3,    0,   -1,  -17,
         -3,    0,    0,    0,   -3,   -1,    1,   -2,   -1,   -7,   -1,
          7,   -2,    2,   -1,   -1,    1,   -2,    6,   -1,    1,    0,
          1,    6,   -3,   -3,    1,    3,   -1,    2,    1,    4,   -2,
          2,    2,   -1,   -3,   -2,  -10,    7,   -3,   -1,   -2,    2,
          1,   -7,   -1,    0,    4,   -1,   -3,   -2,    0,    0,   -6,
         -6,   -3,   -2,    0,    6,   -1,    5,   -2,    0,   -1,   -1,
         -4,    1,   -3,    1,    1,   -6,   -3,   -3,   -1,    1,    1,
         -4,   -1,   -1,    0,    0,    1,    0,   -2,    0,   -1,    5,
         -1,    3,    1,   -8,   -1,    1,   -1,   -5,   -1,    0,    0,
          1,    2,    0,    9,    2,   -3,    2,    0,   -6,   -4,    3,
         -2,   -9,    1,    0,    1,   -2,    1,   -2,    2,   -2,   -2,
          0,    0,   -1,    2,    4,    1,    5,   -2,   -1,   -4,   -9,
         -1,    0,    1,  -10,   -5,   -8,    7,   -1,    1,    1,    0,
          0,   -1,    1,    1,   -2,   -2,   -2,    3,   -4,   -1,    3,
         -2,   -2,   -3,   -3,   -2,   -3,   -3,    0,    1,   10,   -1,
          0,   -1,    3,   -1,    0,   -6,    0,   -2,   -2,    1,    0,
         -1,    0,    0,    1,   -2,   -1,    0,   -3,   -4,    0,    1,
         -2,   -1,    0,   -1,   -1,   -2,    0,    1,    6,    1,    1,
          5,    9,   -8,    0,   17,    1,    1,    5,    1,   -1,  -16,
          0,    1,    2,    0,    0,   -3,    0,   -2,    4,   -2,    0,
          1,   -3,    0,    1,   -1,   -2,   -2,  -93,   -2,    4,    1,
          2,   -4,  -47,    3,   -2,   -1,    8,    0,   -8,   -6,    0,
          0,   -6,    3,    6,   -1,   24,    0,   90,  -13,    1,    6,
         12,    0,    3,    6,    0,    0,   -1,   -3,   -2,   -2,   -5,
         -2,    2,    4,    2,   -1,    1,   -2,   -2,   -2,   -1,    0,
         -2,    1,    0,   -4,    3,    0,    4,   -7,    2,    1,    2,
          1,    1,   -3,    0,   -1,    3,    1,   -2,   -2,   -3,    0,
          4,   -1,   -1,   -1,   -1,   -2,    0,   -2,    0,    0,    6,
         -2,    0,    1,    2,   -2,   10,   -6,   -1,   -1,   -1,   -1,
          0,    0,   -3,   -1,   -4,    0,   -1,    2,   -3,    0,   -3,
          1,   -1,   -2,    0,    0,   -3,   -2,   -1,    0,   -9,    0,
          2,   -1,    3,   -1,   -3,    0,    0,    1,    1,    0,    0,
         -3,    0,    0,   -4,    1,    0,   -1,    1,    2,   -3,   -1,
          1,   -2,   -3,    2,   -1,    0,   -1,   -2,    2,    0,   -1,
          1,    2,   -1,   -4,   -3,   -2,    1,   -2,    1,    4,    1,
         -1,   -1,    2,   -2,    0,    0,   -3,    0,   -6,   -1,   -1,
         -1,    0,   -2,   -3,   -1,    1,    1], dtype=int8)
%sac_diag_gaussian_actor.0.bias, shape: [256], exponents: [-11], docString: b'layout ==> UNK', 
value: array([  -94,     0,  -271,    74,     0,   262,  -109,     0,  -101,
           0,   -20,  -139,  -307,  -322,    -9,  -132,     0,  -100,
         -65,  -238,  -244,   -45,     0,  -120,   -77,    -6,   -71,
           0,  -118,  -244,  -211,  -113,  -200,  -295,  -608,  -270,
           0,     0,   -73,     0,  -139,  -231,     9,  -131,     0,
        -401,  -192,   670,   -49,  -136,   401,  -193,   141,   -75,
           0,  -314,     0,     0,     0,    91,   -83,  -145,  -117,
         -61,     0,  -461,  -250,   -67,     0,  -354,  -115,   160,
        -177,  -118,     0,  -165,   -76,   443,  -375,   -19,   117,
         -85,   -62,   221,  -140,     0,  -157,   -19,   -25,   -34,
        -362,   265,  -115,     0,     0,   768,   -54,     0,   231,
        -362,  -335,   -68,  -147,     0,  -479,  -211,   371,  -472,
          40,  -167,     0,  -152,   -41,   -46,  -200,  -215,     0,
        -142,     0,  -110,  -123,   -57,     0,   176,     0,     0,
           0,   -37,     0,     0,    -4,   211,     0,   323,  -162,
        -133,   -84,  -102,   -95,  -290,   -11,   367,  -111,     0,
         -84,  -108,  -127,     0,   202,   -43,  -237,    -7,     0,
        -119,   -88,  -123,  -185,     0,    61,  -107,  -208,  -116,
        -186,   -19,   804,  -188,  -266,  -172,  -129,     0,  -127,
         -71,   -51,     0,  -896,  -174,   -50,  -133,   -49,  -141,
          15,     0,  -132,     0,   -54,  -179,   -67,  -175,   -23,
        -295,   161,  -216,  -154,  -181,  -258,  -640,     0,   -80,
        -119,     0,   161,     0,   -25,   -48,   200,    -9,  -112,
        -121,    39,     0,  -137,   -97, -1229, -1214,  -111,  -162,
          -4,   -19,   -73,   132,     0,     0,     0,   -37,   -19,
        -161,   -29,  -107,    59,  -245,  -104,   -11,   158,   -12,
         191,     0,   120,  -182,   -36,    35,   102,   -47,   -99,
         -75,   -74,   -60,   163,  -149,     0,   -77,  -133,   -28,
        -130,   -90,   -28,     0], dtype=int32)
%sac_diag_gaussian_actor.4.weight, shape: [1, 1, 256, 16], exponents: [-5], docString: b'layout ==> N16HWC16', 
value: array([ 13,  -4,  41,  22,  -5,   4, -27,  12,  15,  35,  14,  17,  29,
        12,  26,  21,  -8,  -4, -10, -11,   3,  -9,   2,   8,  14,  14,
        14,  16,  17,  17,  14,  14,  12,  -1, -20,   6,  30,  10,  -5,
        -4,  39,  10,  41,  18,  11,  32,  14,  12,   0,  -1,   2,   2,
         0,   0,   0,   0,   2,   2,  -1,   2,   2,   1,   1,   3, -23,
        31,  13,  -3, -36,  -2, -35, -47,  25,  26,  25,  33,  47,  30,
        34,  19,   1,  -3,   3,   0,   0,   1,  -1,  -1,   3,   0,  -1,
        -2,  -4,  -1,   1,   2,   5, -10, -12,   2,  -5,  -5, -16,  16,
         4,   2,  -1,   9,   2,   4,  16,   1,  56,   8,  43,  19,   0,
         6, -18,   4,   7,  -8,   5,  -4, -14,   2,  10,  -5,  -4,  -5,
         4,  -7,  -2,  -2,   2,  -7,  12,  15,  13,  16,  14,  17,   4,
         7,  16,  16,   5,   3,  -7,  14,  -2,   0,  42,  43,  40,  57,
        48,  43,  51,  45,  15,  -8,   5,  13,  10, -22,   9,  -4,  47,
        21,  46,  30,  30,  39,  19,  28,  14, -11, -10,  21,  -6,  18,
        21,   3,   1,   0,   6,  -2,  -2,   0,   0,  -2,  -1,   7, -10,
        -7, -15,   7, -14,  15,   7,   0,   6,  22,   5,   8,  26,   8,
        -2,   2,   0,  -3,   0,   0,   0,   0,  -2,  -3,  -2,   1,  -1,
        -2,   1,  -2,  -4,   4,  11, -52,   8,  23,  -3,   4,   4,  11,
         4,  10,  12,   6,  22,   7,  -1,   2,   8,  -5,  -1,   0,   2,
        -2,   0,   0,   2,  -1,  -4,  -3,   2,   5,   0,   8,   4,   3,
       -18,  -1,  -4, -26,  10,  14,  16,  -3,  17,  11,  -2,   4,  -1,
       -18, -16,   4, -16, -15,   8, -15,  15,   7,  21,  -3,  13,  26,
         3,  23,  -6,  -7,   0, -28,  11,   7,   2,  -3,  11,   8,   9,
        23,  20,   7,   5,  16,   6,  27,   0, -12,  -3,  -7, -23,  19,
         4,   4,   7,   5,   1,   3,  11,   5,  -3, -11,   9,  15,  -5,
        -4,  -5,  -9,  23,  28,  14,  50,  34,  18, 119,  25,   2,  -3,
        -1,  -2,  -1,   2,   2,  -2,   1,   0,  -2,  -3,   0,  -2,  -4,
        -2,   4,   1,   3,  -3,   2,   7,   3,  -1,   5,  -7,   0,  -4,
        -6,   6,  -6,   1,   1,  15,  13,  -2,   5, -20,  21,  22,  25,
        13,  25,  37,  32,  28,   6,  27,  -2,  -1,   0,  -1,   1,  -1,
        -2,   0,  -5,  -1,   2,  -2,   0,  -2,  -2,   1,  10, -11,   6,
        47,  54,  56,  -1,  21,   2,   6,   3,  12,  -3,   0,  31,   1,
        -6,  -9,  24, -16,  -1,   1,  -6,  10,   8,   6,  12,  12,  12,
         7,  17,  12,   5,   5,   3,   5,   4,  -1,  -8,   2,  18,   9,
        16,   8,   9,  14,  21,   8,   3, -36,  -6,   6,  -4,  -2,  -4,
        -3,   3,  11,   7,  14,  12,  10,  -6,  15,  -3,   0,   8,   2,
       -14,   1,  -4,  -9,  15,   8,  11,  28,  34,   9,  15,   9, -12,
       -14, -18,   5,  51, -16,  22,   7,  17,  -1,  10,   6,  12,  11,
         9,   8,  -1, -19, -24,   9, -20,   7,  -8, -14,   7,   0,   6,
        -8,  11,   8,  -5,  -2, -11,  -5,   7,   1,   5,  -6,  -6,  -1,
        29,  41,  36,  53,  22,  37,  70,  38,  56,  -1,  16,   1,   6,
        16, -25,  12,   5,   2,   3,  -2,   4,   8,  37,  10,  -3,  -4,
         1,  -5,   0,   4,   6,  -1,   3,   3,   4,   5,   6,   2,   7,
         9,   3, -14,  45, -10, -24,  -9, -17,   6,  17,  -1,  17,  12,
        16,  13,  24,   6,  -3,  -4, -18,   4, -13, -31,  -4,  17,  25,
        15,  23,   1,  10,  19,  15,   8,  12, -17, -10,  38,  16, -11,
        -8,  -8,   3,   4,   0,  19,   9,  -1,  32,   4, -16,  -3,  -8,
        -2,  11,   6,   6,  17,  14,  22,  16,  14,  32,  16,  12,  19,
        -3,  -2,  -6,  20,  10,   0,   3,   5,  16,  16,  16,  37,  10,
        15,  56,  13, -26,   8,   6, -33,   8,  16,  -5, -14,  26,  10,
        27,  14,  21,  29,  42,  15,  -2, -11,   0,  19,   4,   4,   1,
         6,  36,  16,  41,  31,  18,  38,  23,  24,   2,  20,  60,  14,
        73,  -1,  87,  23,  51,  26,  46,  44,  70,  48,  87,  45, -27,
       -33,  -1,  -1,  -5, -21,  -6,  13,   1,  -1,   3,  -1,  -1,   4,
         6,   2,   3,   3,  -1,   2,   2,  -1,   1,   0,   0,   2,  -2,
         2,   1,  -4,   2,   1,  14, -12, -22,  11,  -3, -10,   7,  -3,
        20,  36,  23,  18,  40,  16,  17,  26,   8,  -2,   1,  -5,   1,
         6,  -7,  11,  11,  10,  10,  11,  22,  10,  23,   9,   9,   7,
        23,  -2,  -8,   1, -18,   4,  11,  21,  15,   3,  12,  13,  32,
        10,   2,  13,  11, -12,  15,  -8,  -3,   7,   1,  -1,   1,  -1,
         0,   2, -11,   0, -12,   4,  -9,  -1,   4,  -6,   5,  -3,   5,
         9,   7,  -6,  11,  10,  -5,  10,   3, -16,  -8,  14,   3, -14,
         9,  -8,   2,  -3,   5,   8,   3,   2,  25,  -5,  11,  -6,  24,
         4, -19,   1,  29,   1,   7,  19,  11,  -7,  25,  15,   8,  18,
       -23,  17,  12, -15,   6, -29,   4, -20,  15,  13,  15,  10,  -1,
        11,  20,  12,   2,  -1,  -4,   0,   1,   2,   2,   0,   1,   3,
        -1,   1,  -5,  -1,   0,   0,  -4,   7,  -3, -11,   2,  -6, -13,
         6,  20,  22,  19,  56,  34,  21,  27,  34,  15,  23,   6,  -1,
         1, -17,  -3,   7,  78,  58,  74,  60,  54,  69,  68,  60, -35,
       -38,  -8,  15,  24,  -5,  -1,   2,  18,   8,  16,  12,  19,  18,
        41,  15,  -9, -16, -37,  31,  17, -18, -36,  16,   4,   8,   4,
        10,  12,   2,  -3,   6,  19,  -7,   1, -10,   7,  -3,   1,   5,
        34,  21,  27,  24,  30,  31,  21,  21,  48, -24, -16, -19,  29,
        -8,  16,  18,   7,  12,   8,  -4,  13,   8,  21,  23,  -5, -13,
        -1,  36,  28,  -6,  -2,  12,   2,   1,   0,   0,   3,   0,   2,
         1,   0,   0,  -2,  -3,   1,  -2,   2,   2,  -4,  -1,   1,  -2,
         1,  -1,  -1,   0,  22,  13,  -7,   9,   4,  17,   2,   4,  27,
         6,  26,   7,   6,  25,   2,  13,  22,  36,  22,  75,  11, -24,
        -9,  -2,  23,  27,  24,  25,  20,  23,  26,  22,  13,   4,  23,
        -1, -20,  -2,   2,  11,   9,  18,  13,  28,   0,  14,  26,  28,
        13, -23,  12,   5, -12, -26,   0,  -6,  13,   4,   6,   3,  14,
         7,  15,   6,   1,  44, -24, -49, -28,  -1, -69,  13,  17,  30,
        18,  13,  38,  18,  22,  32,   7, -42, -39,  -6,  11,  -3,  10,
       -12,  13,  18,  16,  17,  26,  16,  34,  19,   1,  -2, -26, -22,
        23, -22, -40,  26,  34,  35,  30,  56,  39,  30,  49,  33,  11,
       -45,  35, -20,   1, -15,  19,  29,  17,  32,  25,  84,  42,  23,
        40,  32,   2,  -7,   6, -12,   7, -10,  18,  15,  13,  22,   5,
        16,  15,  10,  88,  29,   8,   2,  -8,  -4,  32,  -6,  11, -22,
        18,  20,  18,  31,  42,  15,  65,  21,   4,   3,   0,  -1,   1,
         0,  -2,  -2,   0,   1,  -1,   0,   1,   1,   3,   3,  14,  22,
        18,  15, -29, -18,  39,  47,  10,   5,   4,   4,   7,   4,   4,
         4,  -3,   0,  -3,   7,   0,   2, -23,  -4,  10,   8,  11,  12,
        18,  13,  34,   9,   1,  -8,   4,   8,  -4,   4,  -7,   0,  51,
        50,  55,  29,  28,  52,  18,  39,   3,   1,  -3,  12,  -6,  11,
         1,  14,   0,   0,   0,   1,  -3,   4,   1,   0,  17, -19, -15,
       -16,  22,  22,  14,   0,  -3,  -4,   2,  -3,  -1,   3,   5,  -6,
         3,   0, -31,   5, -14,   6,   0,   7,  23,  -9,  18, -12,  -8,
         9,  -5,  -2, -14,   4,  -4,   1,  -7,  -6,  14,   4, 113, 101,
       113,  86,  82, 112, 100, 102,  19,   2,  -4, -15,  16, -13,   5,
        -5,   1,   2,   3,  -1,   2,   0,   0,  -4,   7,  -6,  -4,  -6,
       -10,  -7,  12,  -5,  25,  15,  22,  38,   0,  22,  46,  18,   1,
         3,   1,  -2,  -1,  -2,  -2,   0,   1,   0,  -1,  -3,   0,   1,
         2,  -2,  15, -31,  -6, -59,  -9,  40,  28,  20,   9,  15,  11,
        26,  14,   7,  20,  20,  -5, -22,  11, -28, -15, -20, -17,  -8,
        27,  36,  28,  22,  41,  33,  34,  32,  16, -27,  45, -30,  10,
        12, -17,   6,   2,   8,   3,  29,  -6,   2,  -1,  -3,  17,  -2,
         7,  -1,   3,  -1,   4,   0,   3,   6,   1,   1,   9,   4,   7,
        13, -10,  -4,   4,  -1,   2,  -5,  -6,  -4,   1,   6,   2,  18,
         4,   0,  24,   6,  14, -17,  -2,  -2,  -4, -10,   4,  -1,  35,
        -5,  31,   5,   1,  24,   3,   3,  -7,   9,   0,   9,   4,  10,
        18, -17,  11,  14,  13,   1,  28,  12,  14,   7,   2,   3, -40,
        -8,  41,  18,  -5,  11,  14,   7,  15,  -2,  -2,  14,  30,   1,
         4,   1,  -7,   1,   5,   3,   7, -13,   7,   8,   0,   8,   9,
         2,  22,  14, -34,   1, -40,  -9,  19,  -4,  36,  -5,  22,  24,
        27,  14,  21,  33,  11,  20,   3,  -3,  -3,  18,   1,   6,   2,
       -14,   4,   2,   7,  -7,   2,   4,   4,   6,   9,  -6,  -2, -23,
         0, -10, -26,  -1,  21,  13,  16,  20,  16,  18,  20,  18,   5,
       -54, -12,  -5,   7,   8, -11,  -5,  10,  28,  17,   7,  22,  17,
        -4,  24,   8, -25, -13, -16,  17, -19,   0,  33,  31,  34,  31,
        29,  31,  31,  47,  42, -15, -33,   9,  15,  50, -41,  37, -60,
        21,  28,  24,  27,  14,  21,  40,  18,   4,   0,  -8,  -4,  -5,
         1,   3,   0,   6,   9,   4,   3,   9,   2,   4,   3, -12,  32,
        16, -21,  -6,   7,   2,  -6,  35,  19,  30,  22,  20,  31,   4,
        13,  10, -14,   1, -12, -11, -11,  -1,  24,  -1,  -5,   0,   0,
         2,   2,   0,   1,  13,  -3,   9,  12,  -8,  14, -12, -11,  12,
         7,  13,   9,  36,  10,  26,  13, -16,  59,  -5,   2,  -1, -20,
       -16,  22,  36,  12,  38,   6,  16,  34,  13,  17,  -2,  -2,   4,
        -2,  -2,   0,   3,  -2,   0,   1,  -3,  -1,   1,  -1,  -2,  -1,
       -11,   8, -19,   1,   3,  -1, -11,  -8,  27,  27,  27,  35,  12,
        25,   2,  33,   1,   9,  15,  -4,   5,  -3,  -2,  -2,  15,  14,
        19,  19,  15,  14,  30,  14,   2,   4,  -2,   1,   0,  -6,  -6,
         4,   9,  10,   8,   5,   6,   9,   5,  11,  -7, -18,  26, -36,
        25, -12,  -8,  10,  12,  16,   9,  36,  21,  12,  27,  22, -25,
         8,   1,   3,   6, -29,   5,  35,   3,   5,   2,  -8,  12,   6,
         5,   2,   4,  -3,  -2,   0,   0,   2,   0,   2,   1,   0,  -4,
         1,  -1,  -3,   0,  -3,  -5,  -9,  18,  -6,   2,   3,   9, -10,
        19,  42,  24,  22,  40,  22,   6,  33, -21,   8,  21, -49, -15,
        13,   7,  14,  24,  31,  26,  29,  30,  29,   7,  18,  45,  11,
        22, -11,  17,  27, -18,  26,  61,  38,  65,  52,  45,  59,  36,
        38, -30,   1, -18,   4, -15,  -6,  25,  -8,   7,  10,   6,  19,
         1,   0,   9,   6,   4,  16,  12,   1,  -4,  -1, -21,  14,  29,
        44,  23,  41,  34,  23,  95,  36,  23,  -5,   8,   0,  14,  -9,
         2,  13,   8,  10,   7,  42,  20,   8,  49,  18,  26,  11,  15,
        40,  18,  -4, -12, -10,  51,  83,  56,  38,  75,  59,  59,  79,
        -5,  16,   0,  -3, -18,  21, -14,  16,   5,   9,  12,   5,   5,
         7,   0,   5,  22,   0,   1,  -8,   7,  10,   6,  -2,   8,  -4,
         6,  -1,   0,   4,   3,   3,  28,   6, -29,  -3,  -1,  19, -50,
        30,  32,  31,  23,  43,  69,  25,  18,  35,  -1,  -3, -10,  -4,
        -5,   2,  -3,   5,  28,  27,  27,  33,  53,  30,  33,  31,  12,
        -4,  -6, -10,  -4,   5,   3,  28,  11,   7,   9,  33,  12,   9,
        43,  20,   4,   0,  -5,   1,   1,   6,   0,   6,  14,  -8,   9,
        -5,  -7,   7,  -9,  -5,   4,  -3,   0,  -2,   1,  -2,  -1,   0,
         0,   4,  -2,   3,  -1,   1,   2,   0,  -2,   4,  -4,   2,  -2,
        -7,   3,  -3,   0,   5,   5,   9,   6,   7,   7,   5,  -4,   2,
        -6,   2,   2,  -2,  -3,  -4,   2,   3,   4,   5,   4,   1,   6,
         5, -11,   4,   5,  12,   2,  18, -10, -22,  28,  21,  29,  34,
        22,  26,  15,  15, -20,  -8,  27,  12, -31, -24, -17,  39,  25,
        34,  19,   4,  38,  26,  38,  37, -13, -11,  -4, -20, -10,  -8,
        20, -32,   8,   9,   6,   8,   9,   7,  20,  13, -10,  -1,   3,
       -29, -10,   1,   9,  -6,  13,  22,  12,  23,   8,  13,   8,   5,
         3,   0,   2,  -2,  -3,   1,   0,   4,   0,   3,   5,   3,   8,
         6,   4,   2,  -1,   0,   2,  -5,  -3,   0,  -5,   1,   2,   0,
        -1,   0,   1,  -2,   0,   3,   7,   7,  30,  16,  45,  57, -14,
       -17,  13,   8,   9,  10,  20,  14,  20,  11, -11,   9,  -9,  -5,
         2,  -4,  11, -14,   1,  15,   2,  18,  11,   4,  -5,  -2, -24,
        19, -26,  -5,  26,   6,  13,  -4,  14,   1,  11,   8,  28,  13,
       -23,   3,   6,  -2, -10,  12,  -7,  -8, -10, -11,  11,  15,  12,
        10,  18,  13,  33,   9,  13,  -2,   4,   2,   2,   9,  -3,  -7,
         3,   0,   6, -13,  -6,   1,  -8,   1,  10,  11,  22,  -1,  13,
        -5,   7,  -6,   8,   8,  15,  -1,  10,  11,  10,  10,  -5,  -1,
       -20,  -9,  17, -12,  20, -10,  24,  20,  26,  36,  40,  30,   6,
        34,  -3, -11,  11,  19,  17,   3, -10,  -4,  16,  15,  13,  27,
        17,  10,  41,  15,  -2,  -5,  -2, -12,  -7,   0,  20,  -7,  37,
        32,  44,  19,  24,  43,  29,  35, -12,   7,  -8,  -9, -47,  24,
        -6,   8,   0,   1,   3,   0,   8,   1,  -2,   0,   1,  -1,  -6,
        -2,   8,  -7,   3,  -4,  23,  23,  21,  37,  37,  18,  35,  38,
        -6,   7,   8,   6,  16,  39,  25, -17,  31,  53,  34,  41,  46,
        34,  28,  35, -14, -17,   2, -16,   1,   3,   0,  -8,   3,   0,
         4, -11,  -3,   0,  -5,   7, -13,   7, -12,   3, -14,   5, -12,
       -12,  37,  29,  33,  38,  26,  36,  42,  31,  17, -16,  -2, -36,
       -12, -14,  31,  -6,  35,  35,  36,  68,  39,  43,  45,  38,  -2,
        -3,   2,  -1,   1,  -3,   0,  -1,   0,  -1,  -2,   1,  -1,   1,
         0,   0,  -5,  15, -19,  30,  30,  -4,   9, -34,  25,  31,  25,
        37,  36,  27,  43,  44,  -1,   4, -11, -27,   5,   5,  21,   4,
         8,   2,   5,   6,   7,   6,   7,   2,  14, -38, -24,   7,  -8,
        11, -15,   1,  57,  39,  55,  50,  44,  53,  67,  50,  -5,   1,
        -2,   7,   2,  17,  -2,  -3,  30,  29,  26,  49,  46,  26,  24,
        22,   7,  -3, -44,  19,  -6,  26,  -9,  25,  18,  26,  16,  42,
        28,  19,  29,   9,   5, -14,  24,  35,   9,  26, -23,   1,  12,
         3,  12,   7,  11,   8,  17,   3,   0,  -6,  66, -19,   3,   9,
       -41, -18,   1,   6,   3,   6,   5,   3,   7,   4,   2,  -6,  19,
       -11,   6, -17,  14, -11,   2,   7,   7,  22,  10,   9,  15,  -4,
        -3,  -3,  -7,   3,   9,   1,  -3,   6,  66,  69,  65,  85,  95,
        62,  76,  68,  14,   6,  -1,  42,  30, -13, -11,   9,  17,  24,
        18,  36,  27,  19,  35,  14, -14,   6,   8,  11,   0,  17,  -8,
         2,   9,   9,   7,   6,   2,  12,  14,  10,  -3,   5,   9,  -3,
       -10,   7,   1,  -4,  36,  45,  32,  43,  49,  33,  57,  32,   1,
        -3,   0,  -2,  -2,   3,   1,   2,   2,  -4,   0,  -2,   2,   2,
        -1,  -4,  14, -14,   6,   7,  -2,   4,  20,   4,  27,   3,  29,
         7,   5,  23,  -7,  12,   8,   3, -23, -12,   5, -13,  -5,   4,
        20,  24,  17,  27,  42,  16,  19,  26,   4,  17,  16,  -5, -22,
         0, -28,  24,  16,  19,  14,  27,  32,  14,  24,  21,  -1,  -1,
         1,   1,   0,  -3,  -2,  -2,  -1,   0,  -3,   2,  -2,   1,   0,
        -3,   0,   4,   1,  -1,   0,   0,   0,   0,   0,   1,   1,   0,
         2,   4,   3,   3,   0,  -2,   2,   1,  -1,   2,  -3,  -5,  -1,
        -2,   1,   1,   0,   2,  -2,  -2,  -7,  32,  -4, -16, -19,   5,
