graph main_graph (
  %h_t_in[FLOAT, 3x1x64], exponents: [0]
  %observations[INT8, 1x25], exponents: [-6]
) initializers (
  %Sigmoid_lut_0[INT8, 256]
  %Sigmoid_lut_1[INT8, 256]
  %Tanh_lut_2[INT8, 256]
  %Sigmoid_lut_3[INT8, 256]
  %Sigmoid_lut_4[INT8, 256]
  %Tanh_lut_5[INT8, 256]
  %Sigmoid_lut_6[INT8, 256]
  %Sigmoid_lut_7[INT8, 256]
  %Tanh_lut_8[INT8, 256]
  %Relu_lut_9[INT8, 256]
  %Relu_lut_10[INT8, 256]
  %Tanh_lut_11[INT8, 256]
  %onnx::MatMul_382[INT8, 89x256]
  %onnx::MatMul_299[INT8, 64x192]
  %/rl_gru/Constant_13_output_0[INT64, 1x1]
  %onnx::MatMul_383[INT8, 256x256]
  %onnx::MatMul_355[INT8, 64x192]
  %onnx::MatMul_354[INT8, 64x192]
  %td3_actor_net.4.bias[INT8, 8]
  %/rl_gru/Constant_7_output_0[INT64, 1x1]
  %onnx::MatMul_298[INT8, 25x192]
  %/rl_gru/Constant_2_output_0[INT64, 1x1]
  %onnx::MatMul_384[INT8, 256x8]
  %td3_actor_net.0.bias[INT8, 256]
  %td3_actor_net.2.bias[INT8, 256]
  %onnx::MatMul_327[INT8, 64x192]
  %onnx::MatMul_326[INT8, 64x192]
  %PPQ_Variable_0[INT64, 1]
  %PPQ_Variable_1[INT64, 1]
  %PPQ_Variable_2[INT64, 1]
  %PPQ_Variable_3[INT64, 1]
  %PPQ_Variable_4[INT64, 1]
  %PPQ_Variable_5[INT64, 1]
  %PPQ_Variable_6[INT64, 1]
  %PPQ_Variable_7[INT64, 1]
  %PPQ_Variable_8[INT64, 1]
  %PPQ_Variable_9[INT64, 1]
  %PPQ_Variable_10[INT64, 1]
  %PPQ_Variable_11[INT64, 1]
  %PPQ_Variable_12[INT64, 1]
  %PPQ_Variable_13[INT64, 1]
  %PPQ_Variable_14[INT64, 1]
  %PPQ_Variable_15[INT64, 1]
  %PPQ_Variable_16[INT64, 1]
  %PPQ_Variable_17[INT64, 1]
  %PPQ_Variable_18[INT64, 1]
  %PPQ_Variable_19[INT64, 1]
  %PPQ_Variable_20[INT64, 1]
  %PPQ_Variable_21[INT64, 1]
  %PPQ_Variable_22[INT64, 1]
  %PPQ_Variable_23[INT64, 1]
  %PPQ_Variable_24[INT64, 1]
  %PPQ_Variable_25[INT64, 1]
  %PPQ_Variable_26[INT64, 1]
  %PPQ_Variable_27[INT64, 1]
  %PPQ_Variable_28[INT64, 1]
  %PPQ_Variable_29[INT64, 1]
  %PPQ_Variable_30[INT64, 1]
  %PPQ_Variable_31[INT64, 1]
  %PPQ_Variable_32[INT64, 1]
  %PPQ_Variable_33[INT64, 1]
  %PPQ_Variable_34[INT64, 1]
  %PPQ_Variable_35[INT64, 1]
  %PPQ_Variable_36[INT64, 1]
  %PPQ_Variable_37[INT64, 1]
  %PPQ_Variable_38[INT64, 1]
  %PPQ_Variable_39[INT64, 1]
  %PPQ_Variable_40[INT64, 1]
  %PPQ_Variable_41[INT64, 1]
  %PPQ_Variable_42[INT64, 1]
  %PPQ_Variable_43[INT64, 1]
  %PPQ_Variable_44[INT64, 1]
  %PPQ_Variable_45[INT64, 1]
  %PPQ_Variable_46[INT64, 1]
  %PPQ_Variable_47[INT64, 1]
  %PPQ_Variable_48[INT64, 1]
  %PPQ_Variable_49[INT64, 1]
  %PPQ_Variable_50[INT64, 1]
  %PPQ_Variable_51[INT64, 1]
  %PPQ_Variable_52[INT64, 1]
  %PPQ_Variable_53[INT64, 1]
  %PPQ_Variable_54[INT64, 1]
  %PPQ_Variable_55[INT64, 1]
  %PPQ_Variable_56[INT64, 1]
  %PPQ_Variable_57[INT64, 1]
  %PPQ_Variable_58[INT64, 1]
  %PPQ_Variable_59[INT64, 1]
  %PPQ_Variable_60[INT64, 3]
  %PPQ_Variable_61[INT64, 3]
  %PPQ_Variable_62[INT64, 3]
  %PPQ_Variable_63[INT64, 1]
  %PPQ_Variable_64[INT64, 1]
  %PPQ_Variable_65[INT64, 1]
  %PPQ_Variable_66[INT64, 1]
  %PPQ_Variable_67[INT64, 1]
  %PPQ_Variable_68[INT64, 1]
  %PPQ_Variable_69[INT64, 1]
  %PPQ_Variable_70[INT64, 1]
  %PPQ_Variable_71[INT64, 1]
  %PPQ_Variable_72[INT64, 1]
  %PPQ_Variable_73[INT64, 1]
  %PPQ_Variable_74[INT64, 1]
  %PPQ_Variable_75[INT64, 1]
  %PPQ_Variable_76[INT64, 1]
  %PPQ_Variable_77[INT64, 1]
  %PPQ_Variable_78[INT64, 1]
  %PPQ_Variable_79[INT64, 1]
  %PPQ_Variable_80[INT64, 1]
  %PPQ_Variable_81[INT64, 1]
  %PPQ_Variable_82[INT64, 1]
  %PPQ_Variable_83[INT64, 1]
  %PPQ_Variable_84[INT64, 1]
  %PPQ_Variable_85[INT64, 1]
  %PPQ_Variable_86[INT64, 1]
  %PPQ_Variable_87[INT64, 1]
  %PPQ_Variable_88[INT64, 1]
  %PPQ_Variable_90[FLOAT, 1]
  %PPQ_Variable_91[INT8, 1]
  %PPQ_Variable_93[FLOAT, 1]
  %PPQ_Variable_94[INT8, 1]
  %PPQ_Variable_96[FLOAT, 1]
  %PPQ_Variable_97[INT8, 1]
  %PPQ_Variable_99[FLOAT, 1]
  %PPQ_Variable_100[INT8, 1]
  %PPQ_Variable_102[FLOAT, 1]
  %PPQ_Variable_103[INT8, 1]
  %PPQ_Variable_105[FLOAT, 1]
  %PPQ_Variable_106[INT8, 1]
  %PPQ_Variable_108[FLOAT, 1]
  %PPQ_Variable_109[INT8, 1]
  %PPQ_Variable_111[FLOAT, 1]
  %PPQ_Variable_112[INT8, 1]
  %PPQ_Variable_114[FLOAT, 1]
  %PPQ_Variable_115[INT8, 1]
  %PPQ_Variable_117[FLOAT, 1]
  %PPQ_Variable_118[INT8, 1]
  %PPQ_Variable_120[FLOAT, 1]
  %PPQ_Variable_121[INT8, 1]
  %PPQ_Variable_123[FLOAT, 1]
  %PPQ_Variable_124[INT8, 1]
  %PPQ_Variable_126[FLOAT, 1]
  %PPQ_Variable_127[INT8, 1]
  %PPQ_Variable_129[FLOAT, 1]
  %PPQ_Variable_130[INT8, 1]
  %PPQ_Variable_132[FLOAT, 1]
  %PPQ_Variable_133[INT8, 1]
  %PPQ_Variable_135[FLOAT, 1]
  %PPQ_Variable_136[INT8, 1]
  %PPQ_Variable_138[FLOAT, 1]
  %PPQ_Variable_139[INT8, 1]
  %PPQ_Variable_141[FLOAT, 1]
  %PPQ_Variable_142[INT8, 1]
  %PPQ_Variable_144[FLOAT, 1]
  %PPQ_Variable_145[INT8, 1]
  %PPQ_Variable_147[FLOAT, 1]
  %PPQ_Variable_148[INT8, 1]
  %PPQ_Variable_150[FLOAT, 1]
  %PPQ_Variable_151[INT8, 1]
  %PPQ_Variable_153[FLOAT, 1]
  %PPQ_Variable_154[INT8, 1]
  %PPQ_Variable_156[FLOAT, 1]
  %PPQ_Variable_157[INT8, 1]
) {
  %/rl_gru/Gather_output_0 = Gather[axis = 0, quant_type = 'F32'](%h_t_in, %PPQ_Variable_18)
  %/rl_gru/l0/x2h/MatMul_output_0 = MatMul[activation = 'Linear', quant_type = 'S8'](%observations, %onnx::MatMul_298)
  %/Squeeze_output_0 = Squeeze[quant_type = 'F32'](%observations, %PPQ_Variable_50)
  %PPQ_Variable_89 = QuantizeLinear[quant_type = 'F32'](%/rl_gru/Gather_output_0, %PPQ_Variable_90, %PPQ_Variable_91)
  %PPQ_Variable_92 = QuantizeLinear[quant_type = 'F32'](%/rl_gru/Gather_output_0, %PPQ_Variable_93, %PPQ_Variable_94)
  %/rl_gru/l0/Gather_output_0 = Gather[axis = 0, quant_type = 'S8'](%/rl_gru/l0/x2h/MatMul_output_0, %PPQ_Variable_19)
  %/rl_gru/l0/h2h/MatMul_output_0 = MatMul[activation = 'Linear', quant_type = 'S8'](%PPQ_Variable_89, %onnx::MatMul_299)
  %/rl_gru/l0/Slice_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l0/Gather_output_0, %PPQ_Variable_26, %PPQ_Variable_75, %PPQ_Variable_27, %PPQ_Variable_0)
  %/rl_gru/l0/Slice_1_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l0/Gather_output_0, %PPQ_Variable_76, %PPQ_Variable_63, %PPQ_Variable_28, %PPQ_Variable_1)
  %/rl_gru/l0/Slice_2_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l0/Gather_output_0, %PPQ_Variable_64, %PPQ_Variable_52, %PPQ_Variable_29, %PPQ_Variable_2)
  %/rl_gru/l0/Gather_1_output_0 = Gather[axis = 0, quant_type = 'S8'](%/rl_gru/l0/h2h/MatMul_output_0, %PPQ_Variable_20)
  %/rl_gru/l0/Slice_3_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l0/Gather_1_output_0, %PPQ_Variable_30, %PPQ_Variable_77, %PPQ_Variable_31, %PPQ_Variable_3)
  %/rl_gru/l0/Slice_4_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l0/Gather_1_output_0, %PPQ_Variable_78, %PPQ_Variable_65, %PPQ_Variable_32, %PPQ_Variable_4)
  %/rl_gru/l0/Slice_5_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l0/Gather_1_output_0, %PPQ_Variable_66, %PPQ_Variable_53, %PPQ_Variable_33, %PPQ_Variable_5)
  %PPQ_Variable_116 = RequantizeLinear[quant_type = 'F32'](%/rl_gru/l0/Slice_3_output_0, %PPQ_Variable_117, %PPQ_Variable_118)
  %PPQ_Variable_119 = RequantizeLinear[quant_type = 'F32'](%/rl_gru/l0/Slice_4_output_0, %PPQ_Variable_120, %PPQ_Variable_121)
  %/rl_gru/l0/Add_output_0 = Add[quant_type = 'S8'](%/rl_gru/l0/Slice_output_0, %PPQ_Variable_116)
  %/rl_gru/l0/Add_1_output_0 = Add[quant_type = 'S8'](%/rl_gru/l0/Slice_1_output_0, %PPQ_Variable_119)
  %/rl_gru/l0/Sigmoid_output_0 = Sigmoid[lut = 'Sigmoid_lut_0', quant_type = 'S8'](%/rl_gru/l0/Add_output_0)
  %/rl_gru/l0/Sigmoid_1_output_0 = Sigmoid[lut = 'Sigmoid_lut_1', quant_type = 'S8'](%/rl_gru/l0/Add_1_output_0)
  %/rl_gru/l0/Mul_output_0 = Mul[quant_type = 'S8'](%/rl_gru/l0/Sigmoid_output_0, %/rl_gru/l0/Slice_5_output_0)
  %/rl_gru/l0/Add_2_output_0 = Add[quant_type = 'S8'](%/rl_gru/l0/Slice_2_output_0, %/rl_gru/l0/Mul_output_0)
  %/rl_gru/l0/Tanh_output_0 = Tanh[lut = 'Tanh_lut_2', quant_type = 'S8'](%/rl_gru/l0/Add_2_output_0)
  %PPQ_Variable_122 = RequantizeLinear[quant_type = 'F32'](%/rl_gru/l0/Tanh_output_0, %PPQ_Variable_123, %PPQ_Variable_124)
  %PPQ_Variable_125 = RequantizeLinear[quant_type = 'F32'](%/rl_gru/l0/Tanh_output_0, %PPQ_Variable_126, %PPQ_Variable_127)
  %/rl_gru/l0/Sub_output_0 = Sub[quant_type = 'S8'](%PPQ_Variable_92, %PPQ_Variable_122)
  %/rl_gru/l0/Mul_1_output_0 = Mul[quant_type = 'S8'](%/rl_gru/l0/Sigmoid_1_output_0, %/rl_gru/l0/Sub_output_0)
  %/rl_gru/l0/Add_3_output_0 = Add[quant_type = 'S8'](%PPQ_Variable_125, %/rl_gru/l0/Mul_1_output_0)
  %/rl_gru/Reshape_output_0 = Reshape[allowzero = 0, quant_type = 'S8'](%/rl_gru/l0/Add_3_output_0, %PPQ_Variable_60)
  %PPQ_Variable_149 = DequantizeLinear[quant_type = 'F32'](%/rl_gru/Reshape_output_0, %PPQ_Variable_150, %PPQ_Variable_151)
  %/rl_gru/ScatterND_output_0 = ScatterND[quant_type = 'F32'](%h_t_in, %/rl_gru/Constant_2_output_0, %PPQ_Variable_149)
  %/rl_gru/Gather_2_output_0 = Gather[axis = 0, quant_type = 'F32'](%/rl_gru/ScatterND_output_0, %PPQ_Variable_21)
  %/rl_gru/Gather_3_output_0 = Gather[axis = 0, quant_type = 'F32'](%/rl_gru/ScatterND_output_0, %PPQ_Variable_87)
  %PPQ_Variable_95 = QuantizeLinear[quant_type = 'F32'](%/rl_gru/Gather_2_output_0, %PPQ_Variable_96, %PPQ_Variable_97)
  %PPQ_Variable_98 = QuantizeLinear[quant_type = 'F32'](%/rl_gru/Gather_3_output_0, %PPQ_Variable_99, %PPQ_Variable_100)
  %PPQ_Variable_101 = QuantizeLinear[quant_type = 'F32'](%/rl_gru/Gather_3_output_0, %PPQ_Variable_102, %PPQ_Variable_103)
  %/rl_gru/l1/x2h/MatMul_output_0 = MatMul[activation = 'Linear', quant_type = 'S8'](%PPQ_Variable_95, %onnx::MatMul_326)
  %/rl_gru/l1/h2h/MatMul_output_0 = MatMul[activation = 'Linear', quant_type = 'S8'](%PPQ_Variable_98, %onnx::MatMul_327)
  %/rl_gru/l1/Gather_output_0 = Gather[axis = 0, quant_type = 'S8'](%/rl_gru/l1/x2h/MatMul_output_0, %PPQ_Variable_22)
  %/rl_gru/l1/Gather_1_output_0 = Gather[axis = 0, quant_type = 'S8'](%/rl_gru/l1/h2h/MatMul_output_0, %PPQ_Variable_23)
  %/rl_gru/l1/Slice_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l1/Gather_output_0, %PPQ_Variable_34, %PPQ_Variable_79, %PPQ_Variable_35, %PPQ_Variable_6)
  %/rl_gru/l1/Slice_1_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l1/Gather_output_0, %PPQ_Variable_80, %PPQ_Variable_67, %PPQ_Variable_36, %PPQ_Variable_7)
  %/rl_gru/l1/Slice_2_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l1/Gather_output_0, %PPQ_Variable_68, %PPQ_Variable_54, %PPQ_Variable_37, %PPQ_Variable_8)
  %/rl_gru/l1/Slice_3_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l1/Gather_1_output_0, %PPQ_Variable_38, %PPQ_Variable_81, %PPQ_Variable_39, %PPQ_Variable_9)
  %/rl_gru/l1/Slice_4_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l1/Gather_1_output_0, %PPQ_Variable_82, %PPQ_Variable_69, %PPQ_Variable_40, %PPQ_Variable_10)
  %/rl_gru/l1/Slice_5_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l1/Gather_1_output_0, %PPQ_Variable_70, %PPQ_Variable_55, %PPQ_Variable_41, %PPQ_Variable_11)
  %PPQ_Variable_128 = RequantizeLinear[quant_type = 'F32'](%/rl_gru/l1/Slice_3_output_0, %PPQ_Variable_129, %PPQ_Variable_130)
  %PPQ_Variable_131 = RequantizeLinear[quant_type = 'F32'](%/rl_gru/l1/Slice_4_output_0, %PPQ_Variable_132, %PPQ_Variable_133)
  %/rl_gru/l1/Add_output_0 = Add[quant_type = 'S8'](%/rl_gru/l1/Slice_output_0, %PPQ_Variable_128)
  %/rl_gru/l1/Add_1_output_0 = Add[quant_type = 'S8'](%/rl_gru/l1/Slice_1_output_0, %PPQ_Variable_131)
  %/rl_gru/l1/Sigmoid_output_0 = Sigmoid[lut = 'Sigmoid_lut_3', quant_type = 'S8'](%/rl_gru/l1/Add_output_0)
  %/rl_gru/l1/Sigmoid_1_output_0 = Sigmoid[lut = 'Sigmoid_lut_4', quant_type = 'S8'](%/rl_gru/l1/Add_1_output_0)
  %/rl_gru/l1/Mul_output_0 = Mul[quant_type = 'S8'](%/rl_gru/l1/Sigmoid_output_0, %/rl_gru/l1/Slice_5_output_0)
  %/rl_gru/l1/Add_2_output_0 = Add[quant_type = 'S8'](%/rl_gru/l1/Slice_2_output_0, %/rl_gru/l1/Mul_output_0)
  %/rl_gru/l1/Tanh_output_0 = Tanh[lut = 'Tanh_lut_5', quant_type = 'S8'](%/rl_gru/l1/Add_2_output_0)
  %PPQ_Variable_134 = RequantizeLinear[quant_type = 'F32'](%/rl_gru/l1/Tanh_output_0, %PPQ_Variable_135, %PPQ_Variable_136)
  %PPQ_Variable_137 = RequantizeLinear[quant_type = 'F32'](%/rl_gru/l1/Tanh_output_0, %PPQ_Variable_138, %PPQ_Variable_139)
  %/rl_gru/l1/Sub_output_0 = Sub[quant_type = 'S8'](%PPQ_Variable_101, %PPQ_Variable_134)
  %/rl_gru/l1/Mul_1_output_0 = Mul[quant_type = 'S8'](%/rl_gru/l1/Sigmoid_1_output_0, %/rl_gru/l1/Sub_output_0)
  %/rl_gru/l1/Add_3_output_0 = Add[quant_type = 'S8'](%PPQ_Variable_137, %/rl_gru/l1/Mul_1_output_0)
  %/rl_gru/Reshape_1_output_0 = Reshape[allowzero = 0, quant_type = 'S8'](%/rl_gru/l1/Add_3_output_0, %PPQ_Variable_61)
  %PPQ_Variable_152 = DequantizeLinear[quant_type = 'F32'](%/rl_gru/Reshape_1_output_0, %PPQ_Variable_153, %PPQ_Variable_154)
  %/rl_gru/ScatterND_1_output_0 = ScatterND[quant_type = 'F32'](%/rl_gru/ScatterND_output_0, %/rl_gru/Constant_7_output_0, %PPQ_Variable_152)
  %/rl_gru/Gather_5_output_0 = Gather[axis = 0, quant_type = 'F32'](%/rl_gru/ScatterND_1_output_0, %PPQ_Variable_88)
  %/rl_gru/Gather_6_output_0 = Gather[axis = 0, quant_type = 'F32'](%/rl_gru/ScatterND_1_output_0, %PPQ_Variable_58)
  %PPQ_Variable_104 = QuantizeLinear[quant_type = 'F32'](%/rl_gru/Gather_5_output_0, %PPQ_Variable_105, %PPQ_Variable_106)
  %PPQ_Variable_107 = QuantizeLinear[quant_type = 'F32'](%/rl_gru/Gather_6_output_0, %PPQ_Variable_108, %PPQ_Variable_109)
  %PPQ_Variable_110 = QuantizeLinear[quant_type = 'F32'](%/rl_gru/Gather_6_output_0, %PPQ_Variable_111, %PPQ_Variable_112)
  %/rl_gru/l2/x2h/MatMul_output_0 = MatMul[activation = 'Linear', quant_type = 'S8'](%PPQ_Variable_104, %onnx::MatMul_354)
  %/rl_gru/l2/h2h/MatMul_output_0 = MatMul[activation = 'Linear', quant_type = 'S8'](%PPQ_Variable_107, %onnx::MatMul_355)
  %/rl_gru/l2/Gather_output_0 = Gather[axis = 0, quant_type = 'S8'](%/rl_gru/l2/x2h/MatMul_output_0, %PPQ_Variable_24)
  %/rl_gru/l2/Gather_1_output_0 = Gather[axis = 0, quant_type = 'S8'](%/rl_gru/l2/h2h/MatMul_output_0, %PPQ_Variable_25)
  %/rl_gru/l2/Slice_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l2/Gather_output_0, %PPQ_Variable_42, %PPQ_Variable_83, %PPQ_Variable_43, %PPQ_Variable_12)
  %/rl_gru/l2/Slice_1_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l2/Gather_output_0, %PPQ_Variable_84, %PPQ_Variable_71, %PPQ_Variable_44, %PPQ_Variable_13)
  %/rl_gru/l2/Slice_2_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l2/Gather_output_0, %PPQ_Variable_72, %PPQ_Variable_56, %PPQ_Variable_45, %PPQ_Variable_14)
  %/rl_gru/l2/Slice_3_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l2/Gather_1_output_0, %PPQ_Variable_46, %PPQ_Variable_85, %PPQ_Variable_47, %PPQ_Variable_15)
  %/rl_gru/l2/Slice_4_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l2/Gather_1_output_0, %PPQ_Variable_86, %PPQ_Variable_73, %PPQ_Variable_48, %PPQ_Variable_16)
  %/rl_gru/l2/Slice_5_output_0 = Slice[quant_type = 'S8'](%/rl_gru/l2/Gather_1_output_0, %PPQ_Variable_74, %PPQ_Variable_57, %PPQ_Variable_49, %PPQ_Variable_17)
  %PPQ_Variable_140 = RequantizeLinear[quant_type = 'F32'](%/rl_gru/l2/Slice_3_output_0, %PPQ_Variable_141, %PPQ_Variable_142)
  %PPQ_Variable_143 = RequantizeLinear[quant_type = 'F32'](%/rl_gru/l2/Slice_4_output_0, %PPQ_Variable_144, %PPQ_Variable_145)
  %/rl_gru/l2/Add_output_0 = Add[quant_type = 'S8'](%/rl_gru/l2/Slice_output_0, %PPQ_Variable_140)
  %/rl_gru/l2/Add_1_output_0 = Add[quant_type = 'S8'](%/rl_gru/l2/Slice_1_output_0, %PPQ_Variable_143)
  %/rl_gru/l2/Sigmoid_output_0 = Sigmoid[lut = 'Sigmoid_lut_6', quant_type = 'S8'](%/rl_gru/l2/Add_output_0)
  %/rl_gru/l2/Sigmoid_1_output_0 = Sigmoid[lut = 'Sigmoid_lut_7', quant_type = 'S8'](%/rl_gru/l2/Add_1_output_0)
  %/rl_gru/l2/Mul_output_0 = Mul[quant_type = 'S8'](%/rl_gru/l2/Sigmoid_output_0, %/rl_gru/l2/Slice_5_output_0)
  %/rl_gru/l2/Add_2_output_0 = Add[quant_type = 'S8'](%/rl_gru/l2/Slice_2_output_0, %/rl_gru/l2/Mul_output_0)
  %/rl_gru/l2/Tanh_output_0 = Tanh[lut = 'Tanh_lut_8', quant_type = 'S8'](%/rl_gru/l2/Add_2_output_0)
  %PPQ_Variable_146 = RequantizeLinear[quant_type = 'F32'](%/rl_gru/l2/Tanh_output_0, %PPQ_Variable_147, %PPQ_Variable_148)
  %/rl_gru/l2/Sub_output_0 = Sub[quant_type = 'S8'](%PPQ_Variable_110, %PPQ_Variable_146)
  %/rl_gru/l2/Mul_1_output_0 = Mul[quant_type = 'S8'](%/rl_gru/l2/Sigmoid_1_output_0, %/rl_gru/l2/Sub_output_0)
  %/rl_gru/l2/Add_3_output_0 = Add[quant_type = 'S8'](%/rl_gru/l2/Tanh_output_0, %/rl_gru/l2/Mul_1_output_0)
  %/rl_gru/Reshape_2_output_0 = Reshape[allowzero = 0, quant_type = 'S8'](%/rl_gru/l2/Add_3_output_0, %PPQ_Variable_62)
  %PPQ_Variable_155 = DequantizeLinear[quant_type = 'F32'](%/rl_gru/Reshape_2_output_0, %PPQ_Variable_156, %PPQ_Variable_157)
  %h_t = ScatterND[quant_type = 'F32'](%/rl_gru/ScatterND_1_output_0, %/rl_gru/Constant_13_output_0, %PPQ_Variable_155)
  %/rl_gru/Gather_8_output_0 = Gather[axis = 0, quant_type = 'F32'](%h_t, %PPQ_Variable_59)
  %/Squeeze_1_output_0 = Squeeze[quant_type = 'F32'](%/rl_gru/Gather_8_output_0, %PPQ_Variable_51)
  %/Concat_output_0 = Concat[axis = 0, quant_type = 'F32'](%/Squeeze_output_0, %/Squeeze_1_output_0)
  %PPQ_Variable_113 = QuantizeLinear[quant_type = 'F32'](%/Concat_output_0, %PPQ_Variable_114, %PPQ_Variable_115)
  %/td3_actor_net/td3_actor_net.0/MatMul_output_0 = MatMul[activation = 'Linear', quant_type = 'S8'](%PPQ_Variable_113, %onnx::MatMul_382)
  %/td3_actor_net/td3_actor_net.0/Add_output_0 = Add[quant_type = 'S8'](%td3_actor_net.0.bias, %/td3_actor_net/td3_actor_net.0/MatMul_output_0)
  %/td3_actor_net/td3_actor_net.1/Relu_output_0 = Relu[lut = 'Relu_lut_9', quant_type = 'S8'](%/td3_actor_net/td3_actor_net.0/Add_output_0)
  %/td3_actor_net/td3_actor_net.2/MatMul_output_0 = MatMul[activation = 'Linear', quant_type = 'S8'](%/td3_actor_net/td3_actor_net.1/Relu_output_0, %onnx::MatMul_383)
  %/td3_actor_net/td3_actor_net.2/Add_output_0 = Add[quant_type = 'S8'](%td3_actor_net.2.bias, %/td3_actor_net/td3_actor_net.2/MatMul_output_0)
  %/td3_actor_net/td3_actor_net.3/Relu_output_0 = Relu[lut = 'Relu_lut_10', quant_type = 'S8'](%/td3_actor_net/td3_actor_net.2/Add_output_0)
  %/td3_actor_net/td3_actor_net.4/MatMul_output_0 = MatMul[activation = 'Linear', quant_type = 'S8'](%/td3_actor_net/td3_actor_net.3/Relu_output_0, %onnx::MatMul_384)
  %/td3_actor_net/td3_actor_net.4/Add_output_0 = Add[quant_type = 'S8'](%td3_actor_net.4.bias, %/td3_actor_net/td3_actor_net.4/MatMul_output_0)
  %action = Tanh[lut = 'Tanh_lut_11', quant_type = 'S8'](%/td3_actor_net/td3_actor_net.4/Add_output_0)
  return %h_t, %action
}


initializers value:
%Sigmoid_lut_0, shape: [256], exponents: [-8], 
value: array([ 69,  69,  70,  70,  70,  71,  71,  72,  72,  72,  73,  73,  74,
        74,  74,  75,  75,  76,  76,  77,  77,  77,  78,  78,  79,  79,
        80,  80,  80,  81,  81,  82,  82,  83,  83,  83,  84,  84,  85,
        85,  86,  86,  87,  87,  87,  88,  88,  89,  89,  90,  90,  91,
        91,  92,  92,  92,  93,  93,  94,  94,  95,  95,  96,  96,  97,
        97,  98,  98,  99,  99,  99, 100, 100, 101, 101, 102, 102, 103,
       103, 104, 104, 105, 105, 106, 106, 107, 107, 108, 108, 109, 109,
       110, 110, 111, 111, 112, 112, 113, 113, 114, 114, 115, 115, 116,
       116, 117, 117, 118, 118, 119, 119, 120, 120, 121, 121, 122, 122,
       123, 123, 124, 124, 125, 125, 126, 126, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127], dtype=int8)
%Sigmoid_lut_1, shape: [256], exponents: [-8], 
value: array([ 69,  69,  70,  70,  70,  71,  71,  72,  72,  72,  73,  73,  74,
        74,  74,  75,  75,  76,  76,  77,  77,  77,  78,  78,  79,  79,
        80,  80,  80,  81,  81,  82,  82,  83,  83,  83,  84,  84,  85,
        85,  86,  86,  87,  87,  87,  88,  88,  89,  89,  90,  90,  91,
        91,  92,  92,  92,  93,  93,  94,  94,  95,  95,  96,  96,  97,
        97,  98,  98,  99,  99,  99, 100, 100, 101, 101, 102, 102, 103,
       103, 104, 104, 105, 105, 106, 106, 107, 107, 108, 108, 109, 109,
       110, 110, 111, 111, 112, 112, 113, 113, 114, 114, 115, 115, 116,
       116, 117, 117, 118, 118, 119, 119, 120, 120, 121, 121, 122, 122,
       123, 123, 124, 124, 125, 125, 126, 126, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127], dtype=int8)
%Tanh_lut_2, shape: [256], exponents: [-7], 
value: array([-97, -97, -97, -96, -96, -95, -95, -94, -94, -93, -93, -93, -92,
       -92, -91, -91, -90, -90, -89, -89, -88, -88, -87, -86, -86, -85,
       -85, -84, -84, -83, -82, -82, -81, -81, -80, -79, -79, -78, -78,
       -77, -76, -76, -75, -74, -74, -73, -72, -72, -71, -70, -70, -69,
       -68, -67, -67, -66, -65, -65, -64, -63, -62, -61, -61, -60, -59,
       -58, -58, -57, -56, -55, -54, -54, -53, -52, -51, -50, -49, -48,
       -48, -47, -46, -45, -44, -43, -42, -41, -41, -40, -39, -38, -37,
       -36, -35, -34, -33, -32, -31, -30, -29, -29, -28, -27, -26, -25,
       -24, -23, -22, -21, -20, -19, -18, -17, -16, -15, -14, -13, -12,
       -11, -10,  -9,  -8,  -7,  -6,  -5,  -4,  -3,  -2,  -1,   0,   1,
         2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,  14,
        15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,
        28,  29,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  41,  42,  43,  44,  45,  46,  47,  48,  48,  49,  50,
        51,  52,  53,  54,  54,  55,  56,  57,  58,  58,  59,  60,  61,
        61,  62,  63,  64,  65,  65,  66,  67,  67,  68,  69,  70,  70,
        71,  72,  72,  73,  74,  74,  75,  76,  76,  77,  78,  78,  79,
        79,  80,  81,  81,  82,  82,  83,  84,  84,  85,  85,  86,  86,
        87,  88,  88,  89,  89,  90,  90,  91,  91,  92,  92,  93,  93,
        93,  94,  94,  95,  95,  96,  96,  97,  97], dtype=int8)
%Sigmoid_lut_3, shape: [256], exponents: [-8], 
value: array([ 97,  97,  97,  97,  98,  98,  98,  98,  99,  99,  99,  99,  99,
       100, 100, 100, 100, 101, 101, 101, 101, 102, 102, 102, 102, 103,
       103, 103, 103, 104, 104, 104, 104, 105, 105, 105, 105, 105, 106,
       106, 106, 106, 107, 107, 107, 107, 108, 108, 108, 108, 109, 109,
       109, 109, 110, 110, 110, 110, 111, 111, 111, 111, 112, 112, 112,
       112, 113, 113, 113, 113, 114, 114, 114, 114, 115, 115, 115, 115,
       116, 116, 116, 116, 117, 117, 117, 117, 118, 118, 118, 118, 119,
       119, 119, 119, 120, 120, 120, 120, 121, 121, 121, 121, 122, 122,
       122, 122, 123, 123, 123, 123, 124, 124, 124, 124, 125, 125, 125,
       125, 126, 126, 126, 126, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127], dtype=int8)
%Sigmoid_lut_4, shape: [256], exponents: [-8], 
value: array([ 97,  97,  97,  97,  98,  98,  98,  98,  99,  99,  99,  99,  99,
       100, 100, 100, 100, 101, 101, 101, 101, 102, 102, 102, 102, 103,
       103, 103, 103, 104, 104, 104, 104, 105, 105, 105, 105, 105, 106,
       106, 106, 106, 107, 107, 107, 107, 108, 108, 108, 108, 109, 109,
       109, 109, 110, 110, 110, 110, 111, 111, 111, 111, 112, 112, 112,
       112, 113, 113, 113, 113, 114, 114, 114, 114, 115, 115, 115, 115,
       116, 116, 116, 116, 117, 117, 117, 117, 118, 118, 118, 118, 119,
       119, 119, 119, 120, 120, 120, 120, 121, 121, 121, 121, 122, 122,
       122, 122, 123, 123, 123, 123, 124, 124, 124, 124, 125, 125, 125,
       125, 126, 126, 126, 126, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127], dtype=int8)
%Tanh_lut_5, shape: [256], exponents: [-8], 
value: array([-118, -118, -117, -116, -115, -114, -114, -113, -112, -111, -110,
       -109, -109, -108, -107, -106, -105, -105, -104, -103, -102, -101,
       -100,  -99,  -99,  -98,  -97,  -96,  -95,  -94,  -93,  -93,  -92,
        -91,  -90,  -89,  -88,  -87,  -86,  -86,  -85,  -84,  -83,  -82,
        -81,  -80,  -79,  -78,  -77,  -77,  -76,  -75,  -74,  -73,  -72,
        -71,  -70,  -69,  -68,  -67,  -66,  -66,  -65,  -64,  -63,  -62,
        -61,  -60,  -59,  -58,  -57,  -56,  -55,  -54,  -53,  -52,  -51,
        -50,  -49,  -48,  -47,  -46,  -46,  -45,  -44,  -43,  -42,  -41,
        -40,  -39,  -38,  -37,  -36,  -35,  -34,  -33,  -32,  -31,  -30,
        -29,  -28,  -27,  -26,  -25,  -24,  -23,  -22,  -21,  -20,  -19,
        -18,  -17,  -16,  -15,  -14,  -13,  -12,  -11,  -10,   -9,   -8,
         -7,   -6,   -5,   -4,   -3,   -2,   -1,    0,    1,    2,    3,
          4,    5,    6,    7,    8,    9,   10,   11,   12,   13,   14,
         15,   16,   17,   18,   19,   20,   21,   22,   23,   24,   25,
         26,   27,   28,   29,   30,   31,   32,   33,   34,   35,   36,
         37,   38,   39,   40,   41,   42,   43,   44,   45,   46,   46,
         47,   48,   49,   50,   51,   52,   53,   54,   55,   56,   57,
         58,   59,   60,   61,   62,   63,   64,   65,   66,   66,   67,
         68,   69,   70,   71,   72,   73,   74,   75,   76,   77,   77,
         78,   79,   80,   81,   82,   83,   84,   85,   86,   86,   87,
         88,   89,   90,   91,   92,   93,   93,   94,   95,   96,   97,
         98,   99,   99,  100,  101,  102,  103,  104,  105,  105,  106,
        107,  108,  109,  109,  110,  111,  112,  113,  114,  114,  115,
        116,  117,  118], dtype=int8)
%Sigmoid_lut_6, shape: [256], exponents: [-8], 
value: array([112, 112, 112, 112, 113, 113, 113, 113, 113, 113, 113, 113, 114,
       114, 114, 114, 114, 114, 114, 114, 115, 115, 115, 115, 115, 115,
       115, 115, 116, 116, 116, 116, 116, 116, 116, 116, 117, 117, 117,
       117, 117, 117, 117, 117, 118, 118, 118, 118, 118, 118, 118, 118,
       119, 119, 119, 119, 119, 119, 119, 119, 120, 120, 120, 120, 120,
       120, 120, 120, 121, 121, 121, 121, 121, 121, 121, 121, 122, 122,
       122, 122, 122, 122, 122, 122, 123, 123, 123, 123, 123, 123, 123,
       123, 124, 124, 124, 124, 124, 124, 124, 124, 125, 125, 125, 125,
       125, 125, 125, 125, 126, 126, 126, 126, 126, 126, 126, 126, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127], dtype=int8)
%Sigmoid_lut_7, shape: [256], exponents: [-8], 
value: array([112, 112, 112, 112, 113, 113, 113, 113, 113, 113, 113, 113, 114,
       114, 114, 114, 114, 114, 114, 114, 115, 115, 115, 115, 115, 115,
       115, 115, 116, 116, 116, 116, 116, 116, 116, 116, 117, 117, 117,
       117, 117, 117, 117, 117, 118, 118, 118, 118, 118, 118, 118, 118,
       119, 119, 119, 119, 119, 119, 119, 119, 120, 120, 120, 120, 120,
       120, 120, 120, 121, 121, 121, 121, 121, 121, 121, 121, 122, 122,
       122, 122, 122, 122, 122, 122, 123, 123, 123, 123, 123, 123, 123,
       123, 124, 124, 124, 124, 124, 124, 124, 124, 125, 125, 125, 125,
       125, 125, 125, 125, 126, 126, 126, 126, 126, 126, 126, 126, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
       127, 127, 127, 127, 127, 127, 127, 127, 127], dtype=int8)
%Tanh_lut_8, shape: [256], exponents: [-9], 
value: array([-125, -124, -124, -123, -122, -121, -120, -119, -118, -117, -116,
       -115, -114, -113, -112, -111, -110, -109, -108, -107, -106, -105,
       -105, -104, -103, -102, -101, -100,  -99,  -98,  -97,  -96,  -95,
        -94,  -93,  -92,  -91,  -90,  -89,  -88,  -87,  -86,  -85,  -84,
        -83,  -82,  -81,  -80,  -79,  -78,  -77,  -76,  -75,  -74,  -73,
        -73,  -72,  -71,  -70,  -69,  -68,  -67,  -66,  -65,  -64,  -63,
        -62,  -61,  -60,  -59,  -58,  -57,  -56,  -55,  -54,  -53,  -52,
        -51,  -50,  -49,  -48,  -47,  -46,  -45,  -44,  -43,  -42,  -41,
        -40,  -39,  -38,  -37,  -36,  -35,  -34,  -33,  -32,  -31,  -30,
        -29,  -28,  -27,  -26,  -25,  -24,  -23,  -22,  -21,  -20,  -19,
        -18,  -17,  -16,  -15,  -14,  -13,  -12,  -11,  -10,   -9,   -8,
         -7,   -6,   -5,   -4,   -3,   -2,   -1,    0,    1,    2,    3,
          4,    5,    6,    7,    8,    9,   10,   11,   12,   13,   14,
         15,   16,   17,   18,   19,   20,   21,   22,   23,   24,   25,
         26,   27,   28,   29,   30,   31,   32,   33,   34,   35,   36,
         37,   38,   39,   40,   41,   42,   43,   44,   45,   46,   47,
         48,   49,   50,   51,   52,   53,   54,   55,   56,   57,   58,
         59,   60,   61,   62,   63,   64,   65,   66,   67,   68,   69,
         70,   71,   72,   73,   73,   74,   75,   76,   77,   78,   79,
         80,   81,   82,   83,   84,   85,   86,   87,   88,   89,   90,
         91,   92,   93,   94,   95,   96,   97,   98,   99,  100,  101,
        102,  103,  104,  105,  105,  106,  107,  108,  109,  110,  111,
        112,  113,  114,  115,  116,  117,  118,  119,  120,  121,  122,
        123,  124,  124], dtype=int8)
%Relu_lut_9, shape: [256], exponents: [-6], 
value: array([  0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   1,
         2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,  14,
        15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,
        28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,  40,
        41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,  53,
        54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,  66,
        67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,  79,
        80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,  92,
        93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104, 105,
       106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118,
       119, 120, 121, 122, 123, 124, 125, 126, 127], dtype=int8)
%Relu_lut_10, shape: [256], exponents: [-5], 
value: array([  0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   1,
         2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,  14,
        15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,
        28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,  40,
        41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,  53,
        54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,  66,
        67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,  79,
        80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,  92,
        93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104, 105,
       106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118,
       119, 120, 121, 122, 123, 124, 125, 126, 127], dtype=int8)
%Tanh_lut_11, shape: [256], exponents: [-7], 
value: array([-128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128,
       -128, -128, -128, -128, -128, -127, -127, -127, -127, -126, -126,
       -125, -124, -123, -122, -120, -118, -116, -113, -109, -104,  -97,
        -90,  -81,  -71,  -59,  -46,  -31,  -16,    0,   16,   31,   46,
         59,   71,   81,   90,   97,  104,  109,  113,  116,  118,  120,
        122,  123,  124,  125,  126,  126,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127,  127,  127,  127,  127,  127,  127,  127,  127,
        127,  127,  127], dtype=int8)
%onnx::MatMul_382, shape: [89, 256], exponents: [-5], docString: b'layout ==> N16HWC16', 
value: array([  -5,    5,  -12,    2,   11,   -7,   -5,   -7,    5,   -5,   -4,
         -2,  -14,  -12,    9,   -1,    3,    4,   -9,    2,   -4,   -5,
          2,  -14,   19,    1,    7,    1,    6,    2,    3,    5,    0,
          2,   15,   -2,  -14,   -5,    1,   -3,   11,    9,   -6,    4,
         -2,    7,   11,   -4,   -3,   -2,   -5,    5,   10,   -4,    2,
          5,   10,   -1,   -1,    3,   12,   -5,    7,  -11,   -3,    4,
          1,    8,   -7,    4,    0,    2,   -6,   -2,   -5,    1,   -8,
         10,   10,    0,   -6,    1,    0,   -6,   -2,   -9,    1,   -7,
         13,    1,   -3,    2,    0,   -5,   16,  -14,   -5,    2,    0,
          4,    0,    3,    0,   15,    3,    9,    2,    4,    5,   -1,
          0,    1,    1,    1,    8,   12,   -2,    9,   -3,   10,   -3,
          2,    2,   -1,  -13,    4,  -10,   -2,   -5,    2,   -6,   -6,
         -5,    6,   13,  -12,  -23,   -8,   -9,    0,    0,    0,   16,
         11,   -5,    2,  -14,    1,   -7,    7,   -7,   -2,   -1,    7,
         -5,   -1,   -1,   -1,   10,    5,    8,    5,   -5,    3,    2,
         -1,    7,   -5,  -11,   -7,    0,   -3,   -7,    7,    0,   -4,
         -2,    2,  -13,   -5,    3,    5,    4,   -5,  -14,   -2,   -5,
         -2,   -9,    1,    7,    3,  -49,  -70,   34,   22,    6,  -16,
        -44,   62,    0,  -21,  -29,   69,   11,   -9,   14,  -25,   -2,
         -4,    3,   -2,   -5,   -4,   -3,   -9,   -5,    3,    2,    1,
          4,    3,   -5,   -2,   20,  -13,   -5,   18,  -11,    0,   26,
        -19,    5,   36,  -54,   22,   18,   28,   42,  -66,   -5,  -42,
        -20,  -18,   41,   17,   86,   38,  -10,   -6,   50,   26,   17,
         44,  -44,    6,   -3,    4,   -7,  -11,   14,    5,    5,    7,
        -15,    4,   -2,   -5,  -14,   -2,    8,    1,    2,  -10,   -9,
          0,    4,    1,    1,  -13,    0,    1,   -4,    5,    1,   -2,
          1,   -3,    0,    3,    0,   -1,   -1,   -3,   -1,   -2,   -3,
          1,    2,   -1,    1,   -1,    1,    0,   -4,    7,    7,   -4,
         -4,   -1,   -2,   -2,    1,   -6,    4,    0,   -2,    3,   -1,
        -12,   -1,   -1,   -4,    1,   -1,   -5,    5,   -2,   -4,   -2,
         -1,    3,    3,   -2,   -3,   -4,    5,   -1,   -8,    4,    1,
         -2,    0,   -3,   -7,    2,   -2,   -3,    0,    3,    1,   -7,
          2,   -3,   -3,    0,   -2,   -3,   -3,   -8,   -4,    2,   -2,
          1,    1,   -2,    1,   -3,    3,   -5,   -4,   -2,    0,   -2,
          4,    0,   -3,    3,    1,    1,    1,    0,   -5,   -3,   -4,
          2,   -3,    2,   -2,   -3,   -2,   -2,   -4,   -2,    0,    1,
          1,    2,   -2,   -3,  -15,   14,   11,   10,   -7,  -14,  -24,
          8,  -34,  -14,    5,  -17,    4,  -25,  -11,    0,    5,  -14,
         -9,    3,    6,   -7,   -3,  -34,  -24,    6,   -2,   -1,    7,
          8,  -13,   -7,   -1,   -5,   -5,   14,   -8,   -5,   -2,   -7,
         -5,    0,   -4,    6,    5,   12,   -2,   -9,    0,  -11,   16,
          5,    8,   -5,    6,   13,   -3,   -4,   -2,   -7,    1,    1,
         -1,    0,    6,    8,  -10,  -10,   -7,   11,    4,  -19,   10,
         -6,    0,    1,    7,   17,   21,  -19,  -11,   -2,    8,   12,
         -3,   -1,    5,   14,  -15,   -3,   -4,   -6,   -5,    5,   -3,
         -1,   12,   -9,  -16,   10,    7,  -12,   -3,  -21,   -4,   19,
         -8,   12,    7,    7,    3,    3,   -4,  -20,  -10,   -3,    7,
         -7,    1,    3,   11,   -1,   -5,    2,    2,    2,  -31,   -3,
          8,    2,   -7,   -6,   14,   -1,   17,  -26,   25,   10,  -18,
         11,  -12,    7,   24,  -12,    4,   -7,    0,   -4,    8,   -3,
          9,   -3,  -19,    9,   -3,   -1,   -9,   -3,  -13,    0,  -18,
          1,   -1,  -28,   -2,    2,   -9,   32,   29,    0,   25,   -6,
         -2,   24,   -4,  -33,   13,  -18,    5,  -51,   26,   -4,   15,
         18,   35,    7,   17,  -12,   -1,   17,  -20,  -13,   22,  -13,
        -23,  -11,    8,  -13,   -4,  -27,   20,   14,   -6,   -4,   11,
         -8,   -7,    7,   -5,   48,   11,  -11,  -15,    5,   -2,  -18,
        -23,    0,   22,  -25,    4,   34,    7,  -25,   21,   -1,  -16,
        -13,   10,   -3,    3,  -23,    8,    8,    1,    5,   12,   -4,
         -2,    5,   -1,    0,    4,   23,   -3,   10,    1,  -10,  -38,
          8,   -7,   -7,   -9,    9,   -5,   11,   -5,    2,   10,  -28,
         12,   19,   11,   10,    9,   -5,   15,  -10,   -4,    7,  -13,
        -25,  -11,    3,    5,   -2,   -7,   -6,   -4,    7,  -34,    4,
          1,   -2,   -4,   -4,  -12,    1,   -3,    8,    9,    3,   -7,
          5,   -5,   12,    3,   -5,   -5,    8,   -6,  -11,    2,    0,
         -3,   23,    2,   14,   -7,   10,    3,   10,   14,  -19,    1,
          4,   -6,    5,    5,   -4,   -5,    8,    9,  -21,    9,   -9,
         15,    6,  -24,    6,   19,  -41,  -20,   23,  -20,   -7,   12,
        -15,   18,    7,   14,   15,    6,   -6,   27,    3,  -21,   31,
         -3,   -5,   23,   -2,   -2,   -3,  -13,   -4,   -5,   -9,  -11,
         -4,   -4,    3,   -2,    5,    0,   -5,  -11,   -5,   -5,   -5,
        -20,  -29,   -7,  -17,  -10,   -9,   40,   12,   13,    3,   15,
         19,   -1,  -18,   -5,   17,    5,    0,   -2,   17,    4,  -11,
        -10,   -4,    2,   -1,    1,   21,    9,   -5,    4,   15,    7,
        -16,    5,   -1,    6,   -3,   19,  -12,    8,  -21,   -4,   -7,
        -29,   -2,    3,  -22,   -8,   11,   -4,   12,   -5,   17,   15,
          0,  -11,   27,    1,  -28,   14,   17,    2,   -8,    5,    3,
          6,   -1,   -4,    3,  -15,    6,  -10,    4,   -7,  -10,   -3,
         11,   -9,   -1,   -2,   -5,   -5,    0,   -7,    9,  -13,   -1,
          7,   -2,    0,   -7,   -7,   -7,  -17,   -5,  -20,    0,   -8,
          2,  -14,  -25,  -31,    7,   -4,    5,    4,    6,   -8,  -14,
         -4,   10,    8,   -8,   -3,   11,   -1,    5,    0,   -5,   11,
          5,   -4,   -4,    6,  -13,    5,   -7,  -19,   19,   11,  -19,
         -5,  -24,  -20,   21,  -22,   28,    7,   -7,   10,   20,    4,
         24,   -8,  -14,    4,   26,    8,  -18,   54,   -7,    6,    2,
          3,   14,   15,   -9,    0,    7,    5,    3,    4,   -2,    7,
         -7,  -27,   -2,    0,   -9,   -4,   15,   -4,    5,    8,  -21,
        -11,   -1,   12,  -13,   -7,   16,   40,   10,   -7,    9,    8,
        -23,   -1,   21,   -4,   12,    0,  -11,   -1,    0,    1,  -16,
         -3,    0,    7,   -5,   -6,    3,   -8,  -10,   18,   -7,   -6,
        -13,   -7,   -1,    6,  -46,  -24,   24,   -4,    7,    4,   15,
          1,   -4,   -4,   -5,  -13,   -3,   -8,   -3,   -4,  -19,  -46,
         13,   -8,    3,   -2,   10,   -5,    4,    0,   27,   17,   24,
         -1,    2,    7,   -2,  -23,   -7,    7,   -6,   -4,   -1,    1,
         13,   13,    5,   12,    9,    1,   14,   -6,   -2,   25,    8,
        -14,   12,    8,  -18,   29,   19,   15,  -24,  -12,  -22,    3,
         39,  -12,    1,   -2,   19,    3,    5,   12,  -19,    3,   28,
        -29,    6,  -11,   -8,  -12,   28,  -18,    3,  -31,   -8,    7,
         -4,   -1,    4,    0,  -14,    0,   -6,    4,   11,    5,   -3,
          1,   -7,   -8,   -7,  -11,    1,    3,    0,   -5,  -13,   -4,
        -20,    4,   -3,   -2,    3,   -4,   11,   -1,    5,   -1,   12,
          0,   -9,   -6,    1,    1,  -10,   -6,  -19,   14,    3,    2,
          4,    7,    8,   15,    4,    0,   37,    4,  -21,   -3,    9,
          5,    1,   -3,    4,   -1,    7,   -3,   -6,    6,    0,   -7,
        -11,   -5,   -2,    1,    4,   15,    0,   -3,   17,    1,    7,
          8,   -9,    6,   10,   11,    0,   17,   -5,    3,    9,    7,
          2,   -3,   -8,   -2,  -26,   -4,   -9,    0,    7,    8,    3,
         -4,   -5,   -6,   10,   -5,  -13,  -15,   12,  -11,   -8,    3,
          4,   18,   -2,   13,   13,   13,    0,   -4,   22,   -4,   -8,
          1,   13,    2,  -42,  -25,    1,    8,  -18,  -14,   11,    2,
         -9,    9,  -12,  -23,    8,    4,  -13,   -2,  -12,  -13,   22,
         -5,    0,    9,   -4,  -16,   27,    9,  -27,   -5,  -16,   13,
          2,   18,  -13,   58,   25,   -8,   26,    4,   19,    4,   -3,
          4,  -11,  -14,   16,   -6,   -6,    1,  -11,   -2,   -2,  -14,
         11,   -1,    4,  -11,    2,    6,  -32,  -25,    3,   17,    0,
         -2,    5,   22,   15,  -13,   10,   10,   -2,  -21,   27,    1,
          0,   -3,   -3,    2,    0,    5,   -7,   -7,    2,    0,   -4,
          4,   16,    7,    0,   -7,    2,   10,   27,    6,   -5,   -8,
          6,  -21,   -7,   -8,    1,   -1,   -6,    2,    2,    2,  -18,
         -8,   -4,    0,   -7,   -3,   -1,   -7,   20,   -3,   -1,    1,
         12,    0,    8,  -12,   23,   19,    2,   -7,   16,    7,   16,
         -3,  -17,   13,   -4,   -3,    6,    7,   -8,    9,   22,    0,
          1,  -20,   15,    3,  -21,   15,   -3,   -2,    5,   -5,   -6,
          7,  -12,   -7,   17,   30,  -17,    0,    0,    1,   15,   17,
        -10,   23,  -13,    5,   27,   -8,  -25,   12,   23,    9,   -8,
          4,   36,    5,    5,   41,  -10,   10,   14,    2,   -2,   22,
         -8,   20,   -4,   -7,   -4,   12,   12,   15,  -28,   28,    1,
         -9,   -9,   -5,    7,    1,   13,   -1,    9,   23,  -13,   23,
         -1,   24,    4,  -23,   -9,    3,  -28,  -24,    7,  -12,  -11,
          8,  -24,  -10,   -4,   11,   10,   20,   -1,  -39,   33,   -8,
         11,    0,   35,   10,   14,    6,   11,    1,    4,    6,    3,
          9,    7,   16,   -1,   -4,   -2,   -8,   -4,   -5,  -16,   13,
          8,    2,   19,   -2,    2,   -3,   -7,   11,   -5,   14,    0,
         -8,   -2,   -3,  -12,   -5,  -19,   -4,   -4,   -8,    0,    6,
         -4,    0,   -5,    3,   -1,   -1,    3,   -6,   -4,   16,   -5,
         -5,   -2,   -9,    3,  -10,   -1,    6,   -1,   -3,   -3,    7,
          0,    5,   -2,   -4,    0,   -6,   -5,  -10,    3,   11,   11,
         -6,    1,   -3,   -7,    3,    0,   -3,    0,   13,  -10,   14,
          2,   -2,   -3,    2,    0,  -20,    9,   10,   -1,    3,    2,
          0,    2,   -5,    1,    2,   -4,   -3,    9,   15,    3,   23,
          0,   13,    0,  -13,   -4,   -7,   11,    6,    3,    8,   -1,
        -11,    2,    6,   -2,    5,    2,  -16,    1,   10,    0,    6,
          4,  -19,    0,    0,  -26,   10,    4,  -17,   -5,  -14,   -3,
        -25,    7,  -17,    4,   -1,    2,   -8,   -6,   -1,   -5,    5,
          2,   -2,    0,  -14,   -3,  -17,   -3,   -4,  -10,    1,   -6,
          7,   -4,    8,   -7,    2,   -4,   -2,    4,   10,    7,  -11,
          0,    7,    6,  -16,   -5,    0,   -5,    0,  -14,    6,   -1,
         -7,    3,   -4,   -5,  -10,    2,   -5,   -4,   -8,   -2,   11,
         25,    2,   49,    7,   15,   10,   -1,  -44,   47,   50,  107,
         -5,  -65,   -2,   37,   -1,   -3,   -1,   -2,    0,    2,    4,
          4,   -5,    1,    5,    0,    1,   -1,   -2,   13,  -22,  -14,
          6,    5,  -41,   -8,   11,   -2,   -9,  -10,  -17,  -47,  -30,
         32,   30,  -36,   15,  -11,   -5,  -10,   10,   46,   24,  -84,
         51,   -7,    5,  -17,   -5,  -53,  -22,   27,    6,   -5,   -3,
        -12,   17,    1,   -5,    7,   -6,   -7,   -3,    6,   -6,  -12,
        -13,   -1,    3,    1,   -1,    3,   -1,    4,   -6,   -4,   -2,
         -2,    2,   -2,   -3,   -3,   -1,   -7,   -1,   -4,    0,    2,
         -3,    0,   -1,   -1,   -7,   -2,   -1,    2,    2,   -2,   -1,
         -5,   -8,   -8,    2,   -1,   -3,    5,    2,    1,   -5,   -1,
         -3,    2,    4,   -3,    6,   -3,   -2,   -5,   -5,   -4,   -3,
          2,   -6,   -3,   -3,   -2,   -8,   -1,    1,   -6,   -1,   -4,
         -7,   -1,    1,   -2,   -3,    2,   -7,   -2,   -6,    1,   -5,
         -4,   -3,    0,   -1,    0,   -1,   -4,   -4,   -2,    1,   -1,
         -1,    1,  -14,    2,   -4,   -2,   -1,    1,    1,   -3,   -1,
         -1,    1,   -4,    0,    3,   -2,   -5,    0,    2,   -3,    2,
         -2,   -5,    3,    0,   -3,   -4,    5,    0,   -2,   -3,   -2,
         -1,   -8,    2,   -5,   -1,    4,   -3,    4,   -1,  -17,  -18,
        -19,  -19,   13,    7,   -2,  -17,  -31,    2,   11,    5,    5,
         22,    4,   -3,    6,    0,    4,  -15,   11,   -5,  -42,  -36,
        -43,   28,  -23,    1,   -3,    1,  -19,    5,    2,   -1,    4,
         -2,    7,   -4,   -9,  -19,    8,   15,  -11,    9,   -5,   -7,
        -12,    0,    3,   -1,   -6,   -3,  -13,   11,   -6,    7,    5,
          0,   19,   -8,   -4,    1,   11,   -4,   23,   36,   24,   14,
         -3,  -10,  -16,    7,  -17,   26,  -20,   -2,    2,    9,  -20,
         -1,   -7,   -7,   -4,   -3,    4,   15,    8,    6,   31,  -13,
         -4,    6,   -5,  -12,   10,    4,    2,   26,    0,   -6,   35,
          1,  -16,  -15,  -22,   25,  -15,    8,   -9,   -2,  -18,    8,
          4,  -10,   13,   -9,  -24,   -2,    4,  -32,   19,    8,   -5,
